zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
/* VFCCU_2 - Peripheral instance base addresses */
/** Peripheral VFCCU_2 base address */
#define IP_VFCCU_2_BASE                          (0x40B6C000u)
/** Peripheral VFCCU_2 base pointer */
#define IP_VFCCU_2                               ((VFCCU_2_Type *)IP_VFCCU_2_BASE)
/** Array initializer of VFCCU_2 peripheral base addresses */
#define IP_VFCCU_2_BASE_ADDRS                    { IP_VFCCU_2_BASE }
/** Array initializer of VFCCU_2 peripheral base pointers */
#define IP_VFCCU_2_BASE_PTRS                     { IP_VFCCU_2 }

/* ----------------------------------------------------------------------------
   -- VFCCU_2 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VFCCU_2_Register_Masks VFCCU_2 Register Masks
 * @{
 */

/*! @name GFLTPO_C0 - Global Fault Polarity */
/*! @{ */

#define VFCCU_2_GFLTPO_C0_PS0_MASK               (0x1U)
#define VFCCU_2_GFLTPO_C0_PS0_SHIFT              (0U)
#define VFCCU_2_GFLTPO_C0_PS0_WIDTH              (1U)
#define VFCCU_2_GFLTPO_C0_PS0(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS0_SHIFT)) & VFCCU_2_GFLTPO_C0_PS0_MASK)

#define VFCCU_2_GFLTPO_C0_PS1_MASK               (0x2U)
#define VFCCU_2_GFLTPO_C0_PS1_SHIFT              (1U)
#define VFCCU_2_GFLTPO_C0_PS1_WIDTH              (1U)
#define VFCCU_2_GFLTPO_C0_PS1(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS1_SHIFT)) & VFCCU_2_GFLTPO_C0_PS1_MASK)

#define VFCCU_2_GFLTPO_C0_PS2_MASK               (0x4U)
#define VFCCU_2_GFLTPO_C0_PS2_SHIFT              (2U)
#define VFCCU_2_GFLTPO_C0_PS2_WIDTH              (1U)
#define VFCCU_2_GFLTPO_C0_PS2(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS2_SHIFT)) & VFCCU_2_GFLTPO_C0_PS2_MASK)

#define VFCCU_2_GFLTPO_C0_PS3_MASK               (0x8U)
#define VFCCU_2_GFLTPO_C0_PS3_SHIFT              (3U)
#define VFCCU_2_GFLTPO_C0_PS3_WIDTH              (1U)
#define VFCCU_2_GFLTPO_C0_PS3(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS3_SHIFT)) & VFCCU_2_GFLTPO_C0_PS3_MASK)

#define VFCCU_2_GFLTPO_C0_PS4_MASK               (0x10U)
#define VFCCU_2_GFLTPO_C0_PS4_SHIFT              (4U)
#define VFCCU_2_GFLTPO_C0_PS4_WIDTH              (1U)
#define VFCCU_2_GFLTPO_C0_PS4(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS4_SHIFT)) & VFCCU_2_GFLTPO_C0_PS4_MASK)

#define VFCCU_2_GFLTPO_C0_PS5_MASK               (0x20U)
#define VFCCU_2_GFLTPO_C0_PS5_SHIFT              (5U)
#define VFCCU_2_GFLTPO_C0_PS5_WIDTH              (1U)
#define VFCCU_2_GFLTPO_C0_PS5(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS5_SHIFT)) & VFCCU_2_GFLTPO_C0_PS5_MASK)

#define VFCCU_2_GFLTPO_C0_PS6_MASK               (0x40U)
#define VFCCU_2_GFLTPO_C0_PS6_SHIFT              (6U)
#define VFCCU_2_GFLTPO_C0_PS6_WIDTH              (1U)
#define VFCCU_2_GFLTPO_C0_PS6(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS6_SHIFT)) & VFCCU_2_GFLTPO_C0_PS6_MASK)

#define VFCCU_2_GFLTPO_C0_PS7_MASK               (0x80U)
#define VFCCU_2_GFLTPO_C0_PS7_SHIFT              (7U)
#define VFCCU_2_GFLTPO_C0_PS7_WIDTH              (1U)
#define VFCCU_2_GFLTPO_C0_PS7(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS7_SHIFT)) & VFCCU_2_GFLTPO_C0_PS7_MASK)

#define VFCCU_2_GFLTPO_C0_PS8_MASK               (0x100U)
#define VFCCU_2_GFLTPO_C0_PS8_SHIFT              (8U)
#define VFCCU_2_GFLTPO_C0_PS8_WIDTH              (1U)
#define VFCCU_2_GFLTPO_C0_PS8(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS8_SHIFT)) & VFCCU_2_GFLTPO_C0_PS8_MASK)

#define VFCCU_2_GFLTPO_C0_PS9_MASK               (0x200U)
#define VFCCU_2_GFLTPO_C0_PS9_SHIFT              (9U)
#define VFCCU_2_GFLTPO_C0_PS9_WIDTH              (1U)
#define VFCCU_2_GFLTPO_C0_PS9(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS9_SHIFT)) & VFCCU_2_GFLTPO_C0_PS9_MASK)

#define VFCCU_2_GFLTPO_C0_PS10_MASK              (0x400U)
#define VFCCU_2_GFLTPO_C0_PS10_SHIFT             (10U)
#define VFCCU_2_GFLTPO_C0_PS10_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C0_PS10(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS10_SHIFT)) & VFCCU_2_GFLTPO_C0_PS10_MASK)

#define VFCCU_2_GFLTPO_C0_PS11_MASK              (0x800U)
#define VFCCU_2_GFLTPO_C0_PS11_SHIFT             (11U)
#define VFCCU_2_GFLTPO_C0_PS11_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C0_PS11(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS11_SHIFT)) & VFCCU_2_GFLTPO_C0_PS11_MASK)

#define VFCCU_2_GFLTPO_C0_PS12_MASK              (0x1000U)
#define VFCCU_2_GFLTPO_C0_PS12_SHIFT             (12U)
#define VFCCU_2_GFLTPO_C0_PS12_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C0_PS12(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS12_SHIFT)) & VFCCU_2_GFLTPO_C0_PS12_MASK)

#define VFCCU_2_GFLTPO_C0_PS13_MASK              (0x2000U)
#define VFCCU_2_GFLTPO_C0_PS13_SHIFT             (13U)
#define VFCCU_2_GFLTPO_C0_PS13_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C0_PS13(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS13_SHIFT)) & VFCCU_2_GFLTPO_C0_PS13_MASK)

#define VFCCU_2_GFLTPO_C0_PS14_MASK              (0x4000U)
#define VFCCU_2_GFLTPO_C0_PS14_SHIFT             (14U)
#define VFCCU_2_GFLTPO_C0_PS14_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C0_PS14(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS14_SHIFT)) & VFCCU_2_GFLTPO_C0_PS14_MASK)

#define VFCCU_2_GFLTPO_C0_PS15_MASK              (0x8000U)
#define VFCCU_2_GFLTPO_C0_PS15_SHIFT             (15U)
#define VFCCU_2_GFLTPO_C0_PS15_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C0_PS15(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS15_SHIFT)) & VFCCU_2_GFLTPO_C0_PS15_MASK)

#define VFCCU_2_GFLTPO_C0_PS16_MASK              (0x10000U)
#define VFCCU_2_GFLTPO_C0_PS16_SHIFT             (16U)
#define VFCCU_2_GFLTPO_C0_PS16_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C0_PS16(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS16_SHIFT)) & VFCCU_2_GFLTPO_C0_PS16_MASK)

#define VFCCU_2_GFLTPO_C0_PS17_MASK              (0x20000U)
#define VFCCU_2_GFLTPO_C0_PS17_SHIFT             (17U)
#define VFCCU_2_GFLTPO_C0_PS17_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C0_PS17(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C0_PS17_SHIFT)) & VFCCU_2_GFLTPO_C0_PS17_MASK)

