zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
#define VFCCU_2_GFLTPO_C2_PS79_MASK              (0x8000U)
#define VFCCU_2_GFLTPO_C2_PS79_SHIFT             (15U)
#define VFCCU_2_GFLTPO_C2_PS79_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS79(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS79_SHIFT)) & VFCCU_2_GFLTPO_C2_PS79_MASK)

#define VFCCU_2_GFLTPO_C2_PS80_MASK              (0x10000U)
#define VFCCU_2_GFLTPO_C2_PS80_SHIFT             (16U)
#define VFCCU_2_GFLTPO_C2_PS80_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS80(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS80_SHIFT)) & VFCCU_2_GFLTPO_C2_PS80_MASK)

#define VFCCU_2_GFLTPO_C2_PS81_MASK              (0x20000U)
#define VFCCU_2_GFLTPO_C2_PS81_SHIFT             (17U)
#define VFCCU_2_GFLTPO_C2_PS81_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS81(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS81_SHIFT)) & VFCCU_2_GFLTPO_C2_PS81_MASK)

#define VFCCU_2_GFLTPO_C2_PS82_MASK              (0x40000U)
#define VFCCU_2_GFLTPO_C2_PS82_SHIFT             (18U)
#define VFCCU_2_GFLTPO_C2_PS82_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS82(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS82_SHIFT)) & VFCCU_2_GFLTPO_C2_PS82_MASK)

#define VFCCU_2_GFLTPO_C2_PS83_MASK              (0x80000U)
#define VFCCU_2_GFLTPO_C2_PS83_SHIFT             (19U)
#define VFCCU_2_GFLTPO_C2_PS83_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS83(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS83_SHIFT)) & VFCCU_2_GFLTPO_C2_PS83_MASK)

#define VFCCU_2_GFLTPO_C2_PS84_MASK              (0x100000U)
#define VFCCU_2_GFLTPO_C2_PS84_SHIFT             (20U)
#define VFCCU_2_GFLTPO_C2_PS84_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS84(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS84_SHIFT)) & VFCCU_2_GFLTPO_C2_PS84_MASK)

#define VFCCU_2_GFLTPO_C2_PS85_MASK              (0x200000U)
#define VFCCU_2_GFLTPO_C2_PS85_SHIFT             (21U)
#define VFCCU_2_GFLTPO_C2_PS85_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS85(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS85_SHIFT)) & VFCCU_2_GFLTPO_C2_PS85_MASK)

#define VFCCU_2_GFLTPO_C2_PS86_MASK              (0x400000U)
#define VFCCU_2_GFLTPO_C2_PS86_SHIFT             (22U)
#define VFCCU_2_GFLTPO_C2_PS86_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS86(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS86_SHIFT)) & VFCCU_2_GFLTPO_C2_PS86_MASK)

#define VFCCU_2_GFLTPO_C2_PS87_MASK              (0x800000U)
#define VFCCU_2_GFLTPO_C2_PS87_SHIFT             (23U)
#define VFCCU_2_GFLTPO_C2_PS87_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS87(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS87_SHIFT)) & VFCCU_2_GFLTPO_C2_PS87_MASK)

#define VFCCU_2_GFLTPO_C2_PS88_MASK              (0x1000000U)
#define VFCCU_2_GFLTPO_C2_PS88_SHIFT             (24U)
#define VFCCU_2_GFLTPO_C2_PS88_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS88(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS88_SHIFT)) & VFCCU_2_GFLTPO_C2_PS88_MASK)

#define VFCCU_2_GFLTPO_C2_PS89_MASK              (0x2000000U)
#define VFCCU_2_GFLTPO_C2_PS89_SHIFT             (25U)
#define VFCCU_2_GFLTPO_C2_PS89_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS89(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS89_SHIFT)) & VFCCU_2_GFLTPO_C2_PS89_MASK)

#define VFCCU_2_GFLTPO_C2_PS90_MASK              (0x4000000U)
#define VFCCU_2_GFLTPO_C2_PS90_SHIFT             (26U)
#define VFCCU_2_GFLTPO_C2_PS90_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS90(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS90_SHIFT)) & VFCCU_2_GFLTPO_C2_PS90_MASK)

#define VFCCU_2_GFLTPO_C2_PS91_MASK              (0x8000000U)
#define VFCCU_2_GFLTPO_C2_PS91_SHIFT             (27U)
#define VFCCU_2_GFLTPO_C2_PS91_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS91(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS91_SHIFT)) & VFCCU_2_GFLTPO_C2_PS91_MASK)

#define VFCCU_2_GFLTPO_C2_PS92_MASK              (0x10000000U)
#define VFCCU_2_GFLTPO_C2_PS92_SHIFT             (28U)
#define VFCCU_2_GFLTPO_C2_PS92_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS92(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS92_SHIFT)) & VFCCU_2_GFLTPO_C2_PS92_MASK)

#define VFCCU_2_GFLTPO_C2_PS93_MASK              (0x20000000U)
#define VFCCU_2_GFLTPO_C2_PS93_SHIFT             (29U)
#define VFCCU_2_GFLTPO_C2_PS93_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS93(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS93_SHIFT)) & VFCCU_2_GFLTPO_C2_PS93_MASK)

#define VFCCU_2_GFLTPO_C2_PS94_MASK              (0x40000000U)
#define VFCCU_2_GFLTPO_C2_PS94_SHIFT             (30U)
#define VFCCU_2_GFLTPO_C2_PS94_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS94(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS94_SHIFT)) & VFCCU_2_GFLTPO_C2_PS94_MASK)

#define VFCCU_2_GFLTPO_C2_PS95_MASK              (0x80000000U)
#define VFCCU_2_GFLTPO_C2_PS95_SHIFT             (31U)
#define VFCCU_2_GFLTPO_C2_PS95_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C2_PS95(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C2_PS95_SHIFT)) & VFCCU_2_GFLTPO_C2_PS95_MASK)
/*! @} */

/*! @name GFLTPO_C3 - Global Fault Polarity */
/*! @{ */

#define VFCCU_2_GFLTPO_C3_PS96_MASK              (0x1U)
#define VFCCU_2_GFLTPO_C3_PS96_SHIFT             (0U)
#define VFCCU_2_GFLTPO_C3_PS96_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C3_PS96(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C3_PS96_SHIFT)) & VFCCU_2_GFLTPO_C3_PS96_MASK)

#define VFCCU_2_GFLTPO_C3_PS97_MASK              (0x2U)
#define VFCCU_2_GFLTPO_C3_PS97_SHIFT             (1U)
#define VFCCU_2_GFLTPO_C3_PS97_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C3_PS97(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C3_PS97_SHIFT)) & VFCCU_2_GFLTPO_C3_PS97_MASK)

#define VFCCU_2_GFLTPO_C3_PS98_MASK              (0x4U)
#define VFCCU_2_GFLTPO_C3_PS98_SHIFT             (2U)
#define VFCCU_2_GFLTPO_C3_PS98_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C3_PS98(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C3_PS98_SHIFT)) & VFCCU_2_GFLTPO_C3_PS98_MASK)

#define VFCCU_2_GFLTPO_C3_PS99_MASK              (0x8U)
#define VFCCU_2_GFLTPO_C3_PS99_SHIFT             (3U)
#define VFCCU_2_GFLTPO_C3_PS99_WIDTH             (1U)
#define VFCCU_2_GFLTPO_C3_PS99(x)                (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C3_PS99_SHIFT)) & VFCCU_2_GFLTPO_C3_PS99_MASK)

#define VFCCU_2_GFLTPO_C3_PS100_MASK             (0x10U)
#define VFCCU_2_GFLTPO_C3_PS100_SHIFT            (4U)
#define VFCCU_2_GFLTPO_C3_PS100_WIDTH            (1U)
#define VFCCU_2_GFLTPO_C3_PS100(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTPO_C3_PS100_SHIFT)) & VFCCU_2_GFLTPO_C3_PS100_MASK)

