zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
#define VFCCU_2_GFLTRC_C0_RHWSW6_MASK            (0x40U)
#define VFCCU_2_GFLTRC_C0_RHWSW6_SHIFT           (6U)
#define VFCCU_2_GFLTRC_C0_RHWSW6_WIDTH           (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW6(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW6_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW6_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW7_MASK            (0x80U)
#define VFCCU_2_GFLTRC_C0_RHWSW7_SHIFT           (7U)
#define VFCCU_2_GFLTRC_C0_RHWSW7_WIDTH           (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW7(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW7_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW7_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW8_MASK            (0x100U)
#define VFCCU_2_GFLTRC_C0_RHWSW8_SHIFT           (8U)
#define VFCCU_2_GFLTRC_C0_RHWSW8_WIDTH           (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW8(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW8_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW8_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW9_MASK            (0x200U)
#define VFCCU_2_GFLTRC_C0_RHWSW9_SHIFT           (9U)
#define VFCCU_2_GFLTRC_C0_RHWSW9_WIDTH           (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW9(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW9_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW9_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW10_MASK           (0x400U)
#define VFCCU_2_GFLTRC_C0_RHWSW10_SHIFT          (10U)
#define VFCCU_2_GFLTRC_C0_RHWSW10_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW10(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW10_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW10_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW11_MASK           (0x800U)
#define VFCCU_2_GFLTRC_C0_RHWSW11_SHIFT          (11U)
#define VFCCU_2_GFLTRC_C0_RHWSW11_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW11(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW11_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW11_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW12_MASK           (0x1000U)
#define VFCCU_2_GFLTRC_C0_RHWSW12_SHIFT          (12U)
#define VFCCU_2_GFLTRC_C0_RHWSW12_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW12(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW12_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW12_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW13_MASK           (0x2000U)
#define VFCCU_2_GFLTRC_C0_RHWSW13_SHIFT          (13U)
#define VFCCU_2_GFLTRC_C0_RHWSW13_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW13(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW13_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW13_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW14_MASK           (0x4000U)
#define VFCCU_2_GFLTRC_C0_RHWSW14_SHIFT          (14U)
#define VFCCU_2_GFLTRC_C0_RHWSW14_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW14(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW14_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW14_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW15_MASK           (0x8000U)
#define VFCCU_2_GFLTRC_C0_RHWSW15_SHIFT          (15U)
#define VFCCU_2_GFLTRC_C0_RHWSW15_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW15(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW15_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW15_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW16_MASK           (0x10000U)
#define VFCCU_2_GFLTRC_C0_RHWSW16_SHIFT          (16U)
#define VFCCU_2_GFLTRC_C0_RHWSW16_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW16(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW16_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW16_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW17_MASK           (0x20000U)
#define VFCCU_2_GFLTRC_C0_RHWSW17_SHIFT          (17U)
#define VFCCU_2_GFLTRC_C0_RHWSW17_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW17(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW17_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW17_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW18_MASK           (0x40000U)
#define VFCCU_2_GFLTRC_C0_RHWSW18_SHIFT          (18U)
#define VFCCU_2_GFLTRC_C0_RHWSW18_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW18(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW18_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW18_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW19_MASK           (0x80000U)
#define VFCCU_2_GFLTRC_C0_RHWSW19_SHIFT          (19U)
#define VFCCU_2_GFLTRC_C0_RHWSW19_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW19(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW19_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW19_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW20_MASK           (0x100000U)
#define VFCCU_2_GFLTRC_C0_RHWSW20_SHIFT          (20U)
#define VFCCU_2_GFLTRC_C0_RHWSW20_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW20(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW20_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW20_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW21_MASK           (0x200000U)
#define VFCCU_2_GFLTRC_C0_RHWSW21_SHIFT          (21U)
#define VFCCU_2_GFLTRC_C0_RHWSW21_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW21(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW21_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW21_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW22_MASK           (0x400000U)
#define VFCCU_2_GFLTRC_C0_RHWSW22_SHIFT          (22U)
#define VFCCU_2_GFLTRC_C0_RHWSW22_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW22(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW22_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW22_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW23_MASK           (0x800000U)
#define VFCCU_2_GFLTRC_C0_RHWSW23_SHIFT          (23U)
#define VFCCU_2_GFLTRC_C0_RHWSW23_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW23(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW23_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW23_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW24_MASK           (0x1000000U)
#define VFCCU_2_GFLTRC_C0_RHWSW24_SHIFT          (24U)
#define VFCCU_2_GFLTRC_C0_RHWSW24_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW24(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW24_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW24_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW25_MASK           (0x2000000U)
#define VFCCU_2_GFLTRC_C0_RHWSW25_SHIFT          (25U)
#define VFCCU_2_GFLTRC_C0_RHWSW25_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW25(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW25_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW25_MASK)

