zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
#define VFCCU_2_GFLTRC_C0_RHWSW26_MASK           (0x4000000U)
#define VFCCU_2_GFLTRC_C0_RHWSW26_SHIFT          (26U)
#define VFCCU_2_GFLTRC_C0_RHWSW26_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW26(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW26_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW26_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW27_MASK           (0x8000000U)
#define VFCCU_2_GFLTRC_C0_RHWSW27_SHIFT          (27U)
#define VFCCU_2_GFLTRC_C0_RHWSW27_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW27(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW27_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW27_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW28_MASK           (0x10000000U)
#define VFCCU_2_GFLTRC_C0_RHWSW28_SHIFT          (28U)
#define VFCCU_2_GFLTRC_C0_RHWSW28_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW28(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW28_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW28_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW29_MASK           (0x20000000U)
#define VFCCU_2_GFLTRC_C0_RHWSW29_SHIFT          (29U)
#define VFCCU_2_GFLTRC_C0_RHWSW29_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW29(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW29_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW29_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW30_MASK           (0x40000000U)
#define VFCCU_2_GFLTRC_C0_RHWSW30_SHIFT          (30U)
#define VFCCU_2_GFLTRC_C0_RHWSW30_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW30(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW30_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW30_MASK)

#define VFCCU_2_GFLTRC_C0_RHWSW31_MASK           (0x80000000U)
#define VFCCU_2_GFLTRC_C0_RHWSW31_SHIFT          (31U)
#define VFCCU_2_GFLTRC_C0_RHWSW31_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C0_RHWSW31(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C0_RHWSW31_SHIFT)) & VFCCU_2_GFLTRC_C0_RHWSW31_MASK)
/*! @} */

/*! @name GFLTRC_C1 - Global Fault Recovery */
/*! @{ */

#define VFCCU_2_GFLTRC_C1_RHWSW32_MASK           (0x1U)
#define VFCCU_2_GFLTRC_C1_RHWSW32_SHIFT          (0U)
#define VFCCU_2_GFLTRC_C1_RHWSW32_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW32(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW32_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW32_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW33_MASK           (0x2U)
#define VFCCU_2_GFLTRC_C1_RHWSW33_SHIFT          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW33_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW33(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW33_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW33_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW34_MASK           (0x4U)
#define VFCCU_2_GFLTRC_C1_RHWSW34_SHIFT          (2U)
#define VFCCU_2_GFLTRC_C1_RHWSW34_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW34(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW34_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW34_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW35_MASK           (0x8U)
#define VFCCU_2_GFLTRC_C1_RHWSW35_SHIFT          (3U)
#define VFCCU_2_GFLTRC_C1_RHWSW35_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW35(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW35_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW35_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW36_MASK           (0x10U)
#define VFCCU_2_GFLTRC_C1_RHWSW36_SHIFT          (4U)
#define VFCCU_2_GFLTRC_C1_RHWSW36_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW36(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW36_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW36_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW37_MASK           (0x20U)
#define VFCCU_2_GFLTRC_C1_RHWSW37_SHIFT          (5U)
#define VFCCU_2_GFLTRC_C1_RHWSW37_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW37(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW37_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW37_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW38_MASK           (0x40U)
#define VFCCU_2_GFLTRC_C1_RHWSW38_SHIFT          (6U)
#define VFCCU_2_GFLTRC_C1_RHWSW38_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW38(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW38_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW38_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW39_MASK           (0x80U)
#define VFCCU_2_GFLTRC_C1_RHWSW39_SHIFT          (7U)
#define VFCCU_2_GFLTRC_C1_RHWSW39_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW39(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW39_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW39_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW40_MASK           (0x100U)
#define VFCCU_2_GFLTRC_C1_RHWSW40_SHIFT          (8U)
#define VFCCU_2_GFLTRC_C1_RHWSW40_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW40(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW40_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW40_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW41_MASK           (0x200U)
#define VFCCU_2_GFLTRC_C1_RHWSW41_SHIFT          (9U)
#define VFCCU_2_GFLTRC_C1_RHWSW41_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW41(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW41_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW41_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW42_MASK           (0x400U)
#define VFCCU_2_GFLTRC_C1_RHWSW42_SHIFT          (10U)
#define VFCCU_2_GFLTRC_C1_RHWSW42_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW42(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW42_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW42_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW43_MASK           (0x800U)
#define VFCCU_2_GFLTRC_C1_RHWSW43_SHIFT          (11U)
#define VFCCU_2_GFLTRC_C1_RHWSW43_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW43(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW43_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW43_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW44_MASK           (0x1000U)
#define VFCCU_2_GFLTRC_C1_RHWSW44_SHIFT          (12U)
#define VFCCU_2_GFLTRC_C1_RHWSW44_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW44(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW44_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW44_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW45_MASK           (0x2000U)
#define VFCCU_2_GFLTRC_C1_RHWSW45_SHIFT          (13U)
#define VFCCU_2_GFLTRC_C1_RHWSW45_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW45(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW45_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW45_MASK)

