zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
#define VFCCU_2_GFLTRC_C1_RHWSW46_MASK           (0x4000U)
#define VFCCU_2_GFLTRC_C1_RHWSW46_SHIFT          (14U)
#define VFCCU_2_GFLTRC_C1_RHWSW46_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW46(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW46_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW46_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW47_MASK           (0x8000U)
#define VFCCU_2_GFLTRC_C1_RHWSW47_SHIFT          (15U)
#define VFCCU_2_GFLTRC_C1_RHWSW47_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW47(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW47_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW47_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW48_MASK           (0x10000U)
#define VFCCU_2_GFLTRC_C1_RHWSW48_SHIFT          (16U)
#define VFCCU_2_GFLTRC_C1_RHWSW48_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW48(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW48_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW48_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW49_MASK           (0x20000U)
#define VFCCU_2_GFLTRC_C1_RHWSW49_SHIFT          (17U)
#define VFCCU_2_GFLTRC_C1_RHWSW49_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW49(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW49_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW49_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW50_MASK           (0x40000U)
#define VFCCU_2_GFLTRC_C1_RHWSW50_SHIFT          (18U)
#define VFCCU_2_GFLTRC_C1_RHWSW50_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW50(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW50_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW50_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW51_MASK           (0x80000U)
#define VFCCU_2_GFLTRC_C1_RHWSW51_SHIFT          (19U)
#define VFCCU_2_GFLTRC_C1_RHWSW51_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW51(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW51_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW51_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW52_MASK           (0x100000U)
#define VFCCU_2_GFLTRC_C1_RHWSW52_SHIFT          (20U)
#define VFCCU_2_GFLTRC_C1_RHWSW52_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW52(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW52_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW52_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW53_MASK           (0x200000U)
#define VFCCU_2_GFLTRC_C1_RHWSW53_SHIFT          (21U)
#define VFCCU_2_GFLTRC_C1_RHWSW53_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW53(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW53_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW53_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW54_MASK           (0x400000U)
#define VFCCU_2_GFLTRC_C1_RHWSW54_SHIFT          (22U)
#define VFCCU_2_GFLTRC_C1_RHWSW54_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW54(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW54_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW54_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW55_MASK           (0x800000U)
#define VFCCU_2_GFLTRC_C1_RHWSW55_SHIFT          (23U)
#define VFCCU_2_GFLTRC_C1_RHWSW55_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW55(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW55_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW55_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW56_MASK           (0x1000000U)
#define VFCCU_2_GFLTRC_C1_RHWSW56_SHIFT          (24U)
#define VFCCU_2_GFLTRC_C1_RHWSW56_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW56(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW56_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW56_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW57_MASK           (0x2000000U)
#define VFCCU_2_GFLTRC_C1_RHWSW57_SHIFT          (25U)
#define VFCCU_2_GFLTRC_C1_RHWSW57_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW57(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW57_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW57_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW58_MASK           (0x4000000U)
#define VFCCU_2_GFLTRC_C1_RHWSW58_SHIFT          (26U)
#define VFCCU_2_GFLTRC_C1_RHWSW58_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW58(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW58_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW58_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW59_MASK           (0x8000000U)
#define VFCCU_2_GFLTRC_C1_RHWSW59_SHIFT          (27U)
#define VFCCU_2_GFLTRC_C1_RHWSW59_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW59(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW59_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW59_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW60_MASK           (0x10000000U)
#define VFCCU_2_GFLTRC_C1_RHWSW60_SHIFT          (28U)
#define VFCCU_2_GFLTRC_C1_RHWSW60_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW60(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW60_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW60_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW61_MASK           (0x20000000U)
#define VFCCU_2_GFLTRC_C1_RHWSW61_SHIFT          (29U)
#define VFCCU_2_GFLTRC_C1_RHWSW61_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW61(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW61_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW61_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW62_MASK           (0x40000000U)
#define VFCCU_2_GFLTRC_C1_RHWSW62_SHIFT          (30U)
#define VFCCU_2_GFLTRC_C1_RHWSW62_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW62(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW62_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW62_MASK)

#define VFCCU_2_GFLTRC_C1_RHWSW63_MASK           (0x80000000U)
#define VFCCU_2_GFLTRC_C1_RHWSW63_SHIFT          (31U)
#define VFCCU_2_GFLTRC_C1_RHWSW63_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C1_RHWSW63(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C1_RHWSW63_SHIFT)) & VFCCU_2_GFLTRC_C1_RHWSW63_MASK)
/*! @} */

/*! @name GFLTRC_C2 - Global Fault Recovery */
/*! @{ */

#define VFCCU_2_GFLTRC_C2_RHWSW64_MASK           (0x1U)
#define VFCCU_2_GFLTRC_C2_RHWSW64_SHIFT          (0U)
#define VFCCU_2_GFLTRC_C2_RHWSW64_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW64(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW64_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW64_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW65_MASK           (0x2U)
#define VFCCU_2_GFLTRC_C2_RHWSW65_SHIFT          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW65_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW65(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW65_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW65_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW66_MASK           (0x4U)
#define VFCCU_2_GFLTRC_C2_RHWSW66_SHIFT          (2U)
#define VFCCU_2_GFLTRC_C2_RHWSW66_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW66(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW66_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW66_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW67_MASK           (0x8U)
#define VFCCU_2_GFLTRC_C2_RHWSW67_SHIFT          (3U)
#define VFCCU_2_GFLTRC_C2_RHWSW67_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW67(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW67_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW67_MASK)

