zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
#define VFCCU_2_GFLTRC_C2_RHWSW68_MASK           (0x10U)
#define VFCCU_2_GFLTRC_C2_RHWSW68_SHIFT          (4U)
#define VFCCU_2_GFLTRC_C2_RHWSW68_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW68(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW68_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW68_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW69_MASK           (0x20U)
#define VFCCU_2_GFLTRC_C2_RHWSW69_SHIFT          (5U)
#define VFCCU_2_GFLTRC_C2_RHWSW69_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW69(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW69_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW69_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW70_MASK           (0x40U)
#define VFCCU_2_GFLTRC_C2_RHWSW70_SHIFT          (6U)
#define VFCCU_2_GFLTRC_C2_RHWSW70_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW70(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW70_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW70_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW71_MASK           (0x80U)
#define VFCCU_2_GFLTRC_C2_RHWSW71_SHIFT          (7U)
#define VFCCU_2_GFLTRC_C2_RHWSW71_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW71(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW71_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW71_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW72_MASK           (0x100U)
#define VFCCU_2_GFLTRC_C2_RHWSW72_SHIFT          (8U)
#define VFCCU_2_GFLTRC_C2_RHWSW72_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW72(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW72_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW72_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW73_MASK           (0x200U)
#define VFCCU_2_GFLTRC_C2_RHWSW73_SHIFT          (9U)
#define VFCCU_2_GFLTRC_C2_RHWSW73_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW73(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW73_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW73_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW74_MASK           (0x400U)
#define VFCCU_2_GFLTRC_C2_RHWSW74_SHIFT          (10U)
#define VFCCU_2_GFLTRC_C2_RHWSW74_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW74(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW74_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW74_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW75_MASK           (0x800U)
#define VFCCU_2_GFLTRC_C2_RHWSW75_SHIFT          (11U)
#define VFCCU_2_GFLTRC_C2_RHWSW75_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW75(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW75_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW75_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW76_MASK           (0x1000U)
#define VFCCU_2_GFLTRC_C2_RHWSW76_SHIFT          (12U)
#define VFCCU_2_GFLTRC_C2_RHWSW76_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW76(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW76_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW76_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW77_MASK           (0x2000U)
#define VFCCU_2_GFLTRC_C2_RHWSW77_SHIFT          (13U)
#define VFCCU_2_GFLTRC_C2_RHWSW77_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW77(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW77_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW77_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW78_MASK           (0x4000U)
#define VFCCU_2_GFLTRC_C2_RHWSW78_SHIFT          (14U)
#define VFCCU_2_GFLTRC_C2_RHWSW78_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW78(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW78_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW78_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW79_MASK           (0x8000U)
#define VFCCU_2_GFLTRC_C2_RHWSW79_SHIFT          (15U)
#define VFCCU_2_GFLTRC_C2_RHWSW79_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW79(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW79_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW79_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW80_MASK           (0x10000U)
#define VFCCU_2_GFLTRC_C2_RHWSW80_SHIFT          (16U)
#define VFCCU_2_GFLTRC_C2_RHWSW80_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW80(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW80_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW80_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW81_MASK           (0x20000U)
#define VFCCU_2_GFLTRC_C2_RHWSW81_SHIFT          (17U)
#define VFCCU_2_GFLTRC_C2_RHWSW81_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW81(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW81_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW81_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW82_MASK           (0x40000U)
#define VFCCU_2_GFLTRC_C2_RHWSW82_SHIFT          (18U)
#define VFCCU_2_GFLTRC_C2_RHWSW82_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW82(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW82_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW82_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW83_MASK           (0x80000U)
#define VFCCU_2_GFLTRC_C2_RHWSW83_SHIFT          (19U)
#define VFCCU_2_GFLTRC_C2_RHWSW83_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW83(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW83_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW83_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW84_MASK           (0x100000U)
#define VFCCU_2_GFLTRC_C2_RHWSW84_SHIFT          (20U)
#define VFCCU_2_GFLTRC_C2_RHWSW84_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW84(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW84_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW84_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW85_MASK           (0x200000U)
#define VFCCU_2_GFLTRC_C2_RHWSW85_SHIFT          (21U)
#define VFCCU_2_GFLTRC_C2_RHWSW85_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW85(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW85_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW85_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW86_MASK           (0x400000U)
#define VFCCU_2_GFLTRC_C2_RHWSW86_SHIFT          (22U)
#define VFCCU_2_GFLTRC_C2_RHWSW86_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW86(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW86_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW86_MASK)

