zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
#define VFCCU_2_GFLTRC_C2_RHWSW87_MASK           (0x800000U)
#define VFCCU_2_GFLTRC_C2_RHWSW87_SHIFT          (23U)
#define VFCCU_2_GFLTRC_C2_RHWSW87_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW87(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW87_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW87_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW88_MASK           (0x1000000U)
#define VFCCU_2_GFLTRC_C2_RHWSW88_SHIFT          (24U)
#define VFCCU_2_GFLTRC_C2_RHWSW88_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW88(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW88_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW88_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW89_MASK           (0x2000000U)
#define VFCCU_2_GFLTRC_C2_RHWSW89_SHIFT          (25U)
#define VFCCU_2_GFLTRC_C2_RHWSW89_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW89(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW89_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW89_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW90_MASK           (0x4000000U)
#define VFCCU_2_GFLTRC_C2_RHWSW90_SHIFT          (26U)
#define VFCCU_2_GFLTRC_C2_RHWSW90_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW90(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW90_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW90_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW91_MASK           (0x8000000U)
#define VFCCU_2_GFLTRC_C2_RHWSW91_SHIFT          (27U)
#define VFCCU_2_GFLTRC_C2_RHWSW91_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW91(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW91_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW91_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW92_MASK           (0x10000000U)
#define VFCCU_2_GFLTRC_C2_RHWSW92_SHIFT          (28U)
#define VFCCU_2_GFLTRC_C2_RHWSW92_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW92(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW92_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW92_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW93_MASK           (0x20000000U)
#define VFCCU_2_GFLTRC_C2_RHWSW93_SHIFT          (29U)
#define VFCCU_2_GFLTRC_C2_RHWSW93_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW93(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW93_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW93_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW94_MASK           (0x40000000U)
#define VFCCU_2_GFLTRC_C2_RHWSW94_SHIFT          (30U)
#define VFCCU_2_GFLTRC_C2_RHWSW94_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW94(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW94_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW94_MASK)

#define VFCCU_2_GFLTRC_C2_RHWSW95_MASK           (0x80000000U)
#define VFCCU_2_GFLTRC_C2_RHWSW95_SHIFT          (31U)
#define VFCCU_2_GFLTRC_C2_RHWSW95_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C2_RHWSW95(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C2_RHWSW95_SHIFT)) & VFCCU_2_GFLTRC_C2_RHWSW95_MASK)
/*! @} */

/*! @name GFLTRC_C3 - Global Fault Recovery */
/*! @{ */

#define VFCCU_2_GFLTRC_C3_RHWSW96_MASK           (0x1U)
#define VFCCU_2_GFLTRC_C3_RHWSW96_SHIFT          (0U)
#define VFCCU_2_GFLTRC_C3_RHWSW96_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW96(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW96_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW96_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW97_MASK           (0x2U)
#define VFCCU_2_GFLTRC_C3_RHWSW97_SHIFT          (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW97_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW97(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW97_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW97_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW98_MASK           (0x4U)
#define VFCCU_2_GFLTRC_C3_RHWSW98_SHIFT          (2U)
#define VFCCU_2_GFLTRC_C3_RHWSW98_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW98(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW98_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW98_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW99_MASK           (0x8U)
#define VFCCU_2_GFLTRC_C3_RHWSW99_SHIFT          (3U)
#define VFCCU_2_GFLTRC_C3_RHWSW99_WIDTH          (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW99(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW99_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW99_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW100_MASK          (0x10U)
#define VFCCU_2_GFLTRC_C3_RHWSW100_SHIFT         (4U)
#define VFCCU_2_GFLTRC_C3_RHWSW100_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW100(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW100_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW100_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW101_MASK          (0x20U)
#define VFCCU_2_GFLTRC_C3_RHWSW101_SHIFT         (5U)
#define VFCCU_2_GFLTRC_C3_RHWSW101_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW101(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW101_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW101_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW102_MASK          (0x40U)
#define VFCCU_2_GFLTRC_C3_RHWSW102_SHIFT         (6U)
#define VFCCU_2_GFLTRC_C3_RHWSW102_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW102(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW102_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW102_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW103_MASK          (0x80U)
#define VFCCU_2_GFLTRC_C3_RHWSW103_SHIFT         (7U)
#define VFCCU_2_GFLTRC_C3_RHWSW103_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW103(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW103_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW103_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW104_MASK          (0x100U)
#define VFCCU_2_GFLTRC_C3_RHWSW104_SHIFT         (8U)
#define VFCCU_2_GFLTRC_C3_RHWSW104_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW104(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW104_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW104_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW105_MASK          (0x200U)
#define VFCCU_2_GFLTRC_C3_RHWSW105_SHIFT         (9U)
#define VFCCU_2_GFLTRC_C3_RHWSW105_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW105(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW105_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW105_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW106_MASK          (0x400U)
#define VFCCU_2_GFLTRC_C3_RHWSW106_SHIFT         (10U)
#define VFCCU_2_GFLTRC_C3_RHWSW106_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW106(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW106_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW106_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW107_MASK          (0x800U)
#define VFCCU_2_GFLTRC_C3_RHWSW107_SHIFT         (11U)
#define VFCCU_2_GFLTRC_C3_RHWSW107_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW107(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW107_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW107_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW108_MASK          (0x1000U)
#define VFCCU_2_GFLTRC_C3_RHWSW108_SHIFT         (12U)
#define VFCCU_2_GFLTRC_C3_RHWSW108_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW108(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW108_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW108_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW109_MASK          (0x2000U)
#define VFCCU_2_GFLTRC_C3_RHWSW109_SHIFT         (13U)
#define VFCCU_2_GFLTRC_C3_RHWSW109_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW109(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW109_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW109_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW110_MASK          (0x4000U)
#define VFCCU_2_GFLTRC_C3_RHWSW110_SHIFT         (14U)
#define VFCCU_2_GFLTRC_C3_RHWSW110_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW110(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW110_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW110_MASK)

