zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
#define VFCCU_2_GFLTRC_C3_RHWSW111_MASK          (0x8000U)
#define VFCCU_2_GFLTRC_C3_RHWSW111_SHIFT         (15U)
#define VFCCU_2_GFLTRC_C3_RHWSW111_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW111(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW111_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW111_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW112_MASK          (0x10000U)
#define VFCCU_2_GFLTRC_C3_RHWSW112_SHIFT         (16U)
#define VFCCU_2_GFLTRC_C3_RHWSW112_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW112(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW112_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW112_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW113_MASK          (0x20000U)
#define VFCCU_2_GFLTRC_C3_RHWSW113_SHIFT         (17U)
#define VFCCU_2_GFLTRC_C3_RHWSW113_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW113(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW113_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW113_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW114_MASK          (0x40000U)
#define VFCCU_2_GFLTRC_C3_RHWSW114_SHIFT         (18U)
#define VFCCU_2_GFLTRC_C3_RHWSW114_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW114(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW114_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW114_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW115_MASK          (0x80000U)
#define VFCCU_2_GFLTRC_C3_RHWSW115_SHIFT         (19U)
#define VFCCU_2_GFLTRC_C3_RHWSW115_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW115(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW115_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW115_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW116_MASK          (0x100000U)
#define VFCCU_2_GFLTRC_C3_RHWSW116_SHIFT         (20U)
#define VFCCU_2_GFLTRC_C3_RHWSW116_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW116(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW116_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW116_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW117_MASK          (0x200000U)
#define VFCCU_2_GFLTRC_C3_RHWSW117_SHIFT         (21U)
#define VFCCU_2_GFLTRC_C3_RHWSW117_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW117(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW117_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW117_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW118_MASK          (0x400000U)
#define VFCCU_2_GFLTRC_C3_RHWSW118_SHIFT         (22U)
#define VFCCU_2_GFLTRC_C3_RHWSW118_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW118(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW118_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW118_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW119_MASK          (0x800000U)
#define VFCCU_2_GFLTRC_C3_RHWSW119_SHIFT         (23U)
#define VFCCU_2_GFLTRC_C3_RHWSW119_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW119(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW119_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW119_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW120_MASK          (0x1000000U)
#define VFCCU_2_GFLTRC_C3_RHWSW120_SHIFT         (24U)
#define VFCCU_2_GFLTRC_C3_RHWSW120_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW120(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW120_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW120_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW121_MASK          (0x2000000U)
#define VFCCU_2_GFLTRC_C3_RHWSW121_SHIFT         (25U)
#define VFCCU_2_GFLTRC_C3_RHWSW121_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW121(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW121_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW121_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW122_MASK          (0x4000000U)
#define VFCCU_2_GFLTRC_C3_RHWSW122_SHIFT         (26U)
#define VFCCU_2_GFLTRC_C3_RHWSW122_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW122(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW122_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW122_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW123_MASK          (0x8000000U)
#define VFCCU_2_GFLTRC_C3_RHWSW123_SHIFT         (27U)
#define VFCCU_2_GFLTRC_C3_RHWSW123_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW123(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW123_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW123_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW124_MASK          (0x10000000U)
#define VFCCU_2_GFLTRC_C3_RHWSW124_SHIFT         (28U)
#define VFCCU_2_GFLTRC_C3_RHWSW124_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW124(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW124_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW124_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW125_MASK          (0x20000000U)
#define VFCCU_2_GFLTRC_C3_RHWSW125_SHIFT         (29U)
#define VFCCU_2_GFLTRC_C3_RHWSW125_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW125(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW125_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW125_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW126_MASK          (0x40000000U)
#define VFCCU_2_GFLTRC_C3_RHWSW126_SHIFT         (30U)
#define VFCCU_2_GFLTRC_C3_RHWSW126_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW126(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW126_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW126_MASK)

#define VFCCU_2_GFLTRC_C3_RHWSW127_MASK          (0x80000000U)
#define VFCCU_2_GFLTRC_C3_RHWSW127_SHIFT         (31U)
#define VFCCU_2_GFLTRC_C3_RHWSW127_WIDTH         (1U)
#define VFCCU_2_GFLTRC_C3_RHWSW127(x)            (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GFLTRC_C3_RHWSW127_SHIFT)) & VFCCU_2_GFLTRC_C3_RHWSW127_MASK)
/*! @} */

/*! @name GINTOVFS - Global DID FSM Status */
/*! @{ */

#define VFCCU_2_GINTOVFS_FLTSERV_MASK            (0x80U)
#define VFCCU_2_GINTOVFS_FLTSERV_SHIFT           (7U)
#define VFCCU_2_GINTOVFS_FLTSERV_WIDTH           (1U)
#define VFCCU_2_GINTOVFS_FLTSERV(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GINTOVFS_FLTSERV_SHIFT)) & VFCCU_2_GINTOVFS_FLTSERV_MASK)

#define VFCCU_2_GINTOVFS_SERV_DID_MASK           (0xF0000U)
#define VFCCU_2_GINTOVFS_SERV_DID_SHIFT          (16U)
#define VFCCU_2_GINTOVFS_SERV_DID_WIDTH          (4U)
#define VFCCU_2_GINTOVFS_SERV_DID(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GINTOVFS_SERV_DID_SHIFT)) & VFCCU_2_GINTOVFS_SERV_DID_MASK)
/*! @} */

/*! @name GDBGCFG - Global Debug */
/*! @{ */

#define VFCCU_2_GDBGCFG_FRZ_MASK                 (0x10000U)
#define VFCCU_2_GDBGCFG_FRZ_SHIFT                (16U)
#define VFCCU_2_GDBGCFG_FRZ_WIDTH                (1U)
#define VFCCU_2_GDBGCFG_FRZ(x)                   (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GDBGCFG_FRZ_SHIFT)) & VFCCU_2_GDBGCFG_FRZ_MASK)
/*! @} */

