zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
/*! @name GDBGSTAT - Global Debug Status */
/*! @{ */

#define VFCCU_2_GDBGSTAT_FLTIND_MASK             (0xFFU)
#define VFCCU_2_GDBGSTAT_FLTIND_SHIFT            (0U)
#define VFCCU_2_GDBGSTAT_FLTIND_WIDTH            (8U)
#define VFCCU_2_GDBGSTAT_FLTIND(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GDBGSTAT_FLTIND_SHIFT)) & VFCCU_2_GDBGSTAT_FLTIND_MASK)

#define VFCCU_2_GDBGSTAT_RKN_ACK_MASK            (0x40000000U)
#define VFCCU_2_GDBGSTAT_RKN_ACK_SHIFT           (30U)
#define VFCCU_2_GDBGSTAT_RKN_ACK_WIDTH           (1U)
#define VFCCU_2_GDBGSTAT_RKN_ACK(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GDBGSTAT_RKN_ACK_SHIFT)) & VFCCU_2_GDBGSTAT_RKN_ACK_MASK)

#define VFCCU_2_GDBGSTAT_RKN_REQ_MASK            (0x80000000U)
#define VFCCU_2_GDBGSTAT_RKN_REQ_SHIFT           (31U)
#define VFCCU_2_GDBGSTAT_RKN_REQ_WIDTH           (1U)
#define VFCCU_2_GDBGSTAT_RKN_REQ(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_GDBGSTAT_RKN_REQ_SHIFT)) & VFCCU_2_GDBGSTAT_RKN_REQ_MASK)
/*! @} */

/*! @name FHCFG0 - Fault Handler */
/*! @{ */

#define VFCCU_2_FHCFG0_FHIDEN_MASK               (0x1U)
#define VFCCU_2_FHCFG0_FHIDEN_SHIFT              (0U)
#define VFCCU_2_FHCFG0_FHIDEN_WIDTH              (1U)
#define VFCCU_2_FHCFG0_FHIDEN(x)                 (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHCFG0_FHIDEN_SHIFT)) & VFCCU_2_FHCFG0_FHIDEN_MASK)
/*! @} */

/*! @name FHSRVDS0 - Fault Handler Status */
/*! @{ */

#define VFCCU_2_FHSRVDS0_SERV_DID_MASK           (0xFU)
#define VFCCU_2_FHSRVDS0_SERV_DID_SHIFT          (0U)
#define VFCCU_2_FHSRVDS0_SERV_DID_WIDTH          (4U)
#define VFCCU_2_FHSRVDS0_SERV_DID(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHSRVDS0_SERV_DID_SHIFT)) & VFCCU_2_FHSRVDS0_SERV_DID_MASK)

#define VFCCU_2_FHSRVDS0_AGGFLTS_MASK            (0x100U)
#define VFCCU_2_FHSRVDS0_AGGFLTS_SHIFT           (8U)
#define VFCCU_2_FHSRVDS0_AGGFLTS_WIDTH           (1U)
#define VFCCU_2_FHSRVDS0_AGGFLTS(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHSRVDS0_AGGFLTS_SHIFT)) & VFCCU_2_FHSRVDS0_AGGFLTS_MASK)
/*! @} */

/*! @name FHFLTENC0_0 - Fault Enable */
/*! @{ */

#define VFCCU_2_FHFLTENC0_0_EN0_MASK             (0x1U)
#define VFCCU_2_FHFLTENC0_0_EN0_SHIFT            (0U)
#define VFCCU_2_FHFLTENC0_0_EN0_WIDTH            (1U)
#define VFCCU_2_FHFLTENC0_0_EN0(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN0_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN0_MASK)

#define VFCCU_2_FHFLTENC0_0_EN1_MASK             (0x2U)
#define VFCCU_2_FHFLTENC0_0_EN1_SHIFT            (1U)
#define VFCCU_2_FHFLTENC0_0_EN1_WIDTH            (1U)
#define VFCCU_2_FHFLTENC0_0_EN1(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN1_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN1_MASK)

#define VFCCU_2_FHFLTENC0_0_EN2_MASK             (0x4U)
#define VFCCU_2_FHFLTENC0_0_EN2_SHIFT            (2U)
#define VFCCU_2_FHFLTENC0_0_EN2_WIDTH            (1U)
#define VFCCU_2_FHFLTENC0_0_EN2(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN2_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN2_MASK)

#define VFCCU_2_FHFLTENC0_0_EN3_MASK             (0x8U)
#define VFCCU_2_FHFLTENC0_0_EN3_SHIFT            (3U)
#define VFCCU_2_FHFLTENC0_0_EN3_WIDTH            (1U)
#define VFCCU_2_FHFLTENC0_0_EN3(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN3_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN3_MASK)

#define VFCCU_2_FHFLTENC0_0_EN4_MASK             (0x10U)
#define VFCCU_2_FHFLTENC0_0_EN4_SHIFT            (4U)
#define VFCCU_2_FHFLTENC0_0_EN4_WIDTH            (1U)
#define VFCCU_2_FHFLTENC0_0_EN4(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN4_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN4_MASK)

#define VFCCU_2_FHFLTENC0_0_EN5_MASK             (0x20U)
#define VFCCU_2_FHFLTENC0_0_EN5_SHIFT            (5U)
#define VFCCU_2_FHFLTENC0_0_EN5_WIDTH            (1U)
#define VFCCU_2_FHFLTENC0_0_EN5(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN5_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN5_MASK)

#define VFCCU_2_FHFLTENC0_0_EN6_MASK             (0x40U)
#define VFCCU_2_FHFLTENC0_0_EN6_SHIFT            (6U)
#define VFCCU_2_FHFLTENC0_0_EN6_WIDTH            (1U)
#define VFCCU_2_FHFLTENC0_0_EN6(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN6_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN6_MASK)

#define VFCCU_2_FHFLTENC0_0_EN7_MASK             (0x80U)
#define VFCCU_2_FHFLTENC0_0_EN7_SHIFT            (7U)
#define VFCCU_2_FHFLTENC0_0_EN7_WIDTH            (1U)
#define VFCCU_2_FHFLTENC0_0_EN7(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN7_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN7_MASK)

#define VFCCU_2_FHFLTENC0_0_EN8_MASK             (0x100U)
#define VFCCU_2_FHFLTENC0_0_EN8_SHIFT            (8U)
#define VFCCU_2_FHFLTENC0_0_EN8_WIDTH            (1U)
#define VFCCU_2_FHFLTENC0_0_EN8(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN8_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN8_MASK)

#define VFCCU_2_FHFLTENC0_0_EN9_MASK             (0x200U)
#define VFCCU_2_FHFLTENC0_0_EN9_SHIFT            (9U)
#define VFCCU_2_FHFLTENC0_0_EN9_WIDTH            (1U)
#define VFCCU_2_FHFLTENC0_0_EN9(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN9_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN9_MASK)

#define VFCCU_2_FHFLTENC0_0_EN10_MASK            (0x400U)
#define VFCCU_2_FHFLTENC0_0_EN10_SHIFT           (10U)
#define VFCCU_2_FHFLTENC0_0_EN10_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN10(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN10_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN10_MASK)

#define VFCCU_2_FHFLTENC0_0_EN11_MASK            (0x800U)
#define VFCCU_2_FHFLTENC0_0_EN11_SHIFT           (11U)
#define VFCCU_2_FHFLTENC0_0_EN11_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN11(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN11_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN11_MASK)

#define VFCCU_2_FHFLTENC0_0_EN12_MASK            (0x1000U)
#define VFCCU_2_FHFLTENC0_0_EN12_SHIFT           (12U)
#define VFCCU_2_FHFLTENC0_0_EN12_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN12(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN12_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN12_MASK)

#define VFCCU_2_FHFLTENC0_0_EN13_MASK            (0x2000U)
#define VFCCU_2_FHFLTENC0_0_EN13_SHIFT           (13U)
#define VFCCU_2_FHFLTENC0_0_EN13_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN13(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN13_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN13_MASK)

#define VFCCU_2_FHFLTENC0_0_EN14_MASK            (0x4000U)
#define VFCCU_2_FHFLTENC0_0_EN14_SHIFT           (14U)
#define VFCCU_2_FHFLTENC0_0_EN14_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN14(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN14_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN14_MASK)

