zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
#define VFCCU_2_FHFLTENC0_0_EN15_MASK            (0x8000U)
#define VFCCU_2_FHFLTENC0_0_EN15_SHIFT           (15U)
#define VFCCU_2_FHFLTENC0_0_EN15_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN15(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN15_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN15_MASK)

#define VFCCU_2_FHFLTENC0_0_EN16_MASK            (0x10000U)
#define VFCCU_2_FHFLTENC0_0_EN16_SHIFT           (16U)
#define VFCCU_2_FHFLTENC0_0_EN16_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN16(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN16_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN16_MASK)

#define VFCCU_2_FHFLTENC0_0_EN17_MASK            (0x20000U)
#define VFCCU_2_FHFLTENC0_0_EN17_SHIFT           (17U)
#define VFCCU_2_FHFLTENC0_0_EN17_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN17(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN17_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN17_MASK)

#define VFCCU_2_FHFLTENC0_0_EN18_MASK            (0x40000U)
#define VFCCU_2_FHFLTENC0_0_EN18_SHIFT           (18U)
#define VFCCU_2_FHFLTENC0_0_EN18_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN18(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN18_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN18_MASK)

#define VFCCU_2_FHFLTENC0_0_EN19_MASK            (0x80000U)
#define VFCCU_2_FHFLTENC0_0_EN19_SHIFT           (19U)
#define VFCCU_2_FHFLTENC0_0_EN19_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN19(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN19_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN19_MASK)

#define VFCCU_2_FHFLTENC0_0_EN20_MASK            (0x100000U)
#define VFCCU_2_FHFLTENC0_0_EN20_SHIFT           (20U)
#define VFCCU_2_FHFLTENC0_0_EN20_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN20(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN20_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN20_MASK)

#define VFCCU_2_FHFLTENC0_0_EN21_MASK            (0x200000U)
#define VFCCU_2_FHFLTENC0_0_EN21_SHIFT           (21U)
#define VFCCU_2_FHFLTENC0_0_EN21_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN21(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN21_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN21_MASK)

#define VFCCU_2_FHFLTENC0_0_EN22_MASK            (0x400000U)
#define VFCCU_2_FHFLTENC0_0_EN22_SHIFT           (22U)
#define VFCCU_2_FHFLTENC0_0_EN22_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN22(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN22_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN22_MASK)

#define VFCCU_2_FHFLTENC0_0_EN23_MASK            (0x800000U)
#define VFCCU_2_FHFLTENC0_0_EN23_SHIFT           (23U)
#define VFCCU_2_FHFLTENC0_0_EN23_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN23(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN23_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN23_MASK)

#define VFCCU_2_FHFLTENC0_0_EN24_MASK            (0x1000000U)
#define VFCCU_2_FHFLTENC0_0_EN24_SHIFT           (24U)
#define VFCCU_2_FHFLTENC0_0_EN24_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN24(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN24_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN24_MASK)

#define VFCCU_2_FHFLTENC0_0_EN25_MASK            (0x2000000U)
#define VFCCU_2_FHFLTENC0_0_EN25_SHIFT           (25U)
#define VFCCU_2_FHFLTENC0_0_EN25_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN25(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN25_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN25_MASK)

#define VFCCU_2_FHFLTENC0_0_EN26_MASK            (0x4000000U)
#define VFCCU_2_FHFLTENC0_0_EN26_SHIFT           (26U)
#define VFCCU_2_FHFLTENC0_0_EN26_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN26(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN26_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN26_MASK)

#define VFCCU_2_FHFLTENC0_0_EN27_MASK            (0x8000000U)
#define VFCCU_2_FHFLTENC0_0_EN27_SHIFT           (27U)
#define VFCCU_2_FHFLTENC0_0_EN27_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN27(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN27_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN27_MASK)

#define VFCCU_2_FHFLTENC0_0_EN28_MASK            (0x10000000U)
#define VFCCU_2_FHFLTENC0_0_EN28_SHIFT           (28U)
#define VFCCU_2_FHFLTENC0_0_EN28_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN28(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN28_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN28_MASK)

#define VFCCU_2_FHFLTENC0_0_EN29_MASK            (0x20000000U)
#define VFCCU_2_FHFLTENC0_0_EN29_SHIFT           (29U)
#define VFCCU_2_FHFLTENC0_0_EN29_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN29(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN29_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN29_MASK)

#define VFCCU_2_FHFLTENC0_0_EN30_MASK            (0x40000000U)
#define VFCCU_2_FHFLTENC0_0_EN30_SHIFT           (30U)
#define VFCCU_2_FHFLTENC0_0_EN30_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN30(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN30_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN30_MASK)

#define VFCCU_2_FHFLTENC0_0_EN31_MASK            (0x80000000U)
#define VFCCU_2_FHFLTENC0_0_EN31_SHIFT           (31U)
#define VFCCU_2_FHFLTENC0_0_EN31_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_0_EN31(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_0_EN31_SHIFT)) & VFCCU_2_FHFLTENC0_0_EN31_MASK)
/*! @} */

/*! @name FHFLTENC0_1 - Fault Enable */
/*! @{ */

#define VFCCU_2_FHFLTENC0_1_EN32_MASK            (0x1U)
#define VFCCU_2_FHFLTENC0_1_EN32_SHIFT           (0U)
#define VFCCU_2_FHFLTENC0_1_EN32_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_1_EN32(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_1_EN32_SHIFT)) & VFCCU_2_FHFLTENC0_1_EN32_MASK)

#define VFCCU_2_FHFLTENC0_1_EN33_MASK            (0x2U)
#define VFCCU_2_FHFLTENC0_1_EN33_SHIFT           (1U)
#define VFCCU_2_FHFLTENC0_1_EN33_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_1_EN33(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_1_EN33_SHIFT)) & VFCCU_2_FHFLTENC0_1_EN33_MASK)

#define VFCCU_2_FHFLTENC0_1_EN34_MASK            (0x4U)
#define VFCCU_2_FHFLTENC0_1_EN34_SHIFT           (2U)
#define VFCCU_2_FHFLTENC0_1_EN34_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_1_EN34(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_1_EN34_SHIFT)) & VFCCU_2_FHFLTENC0_1_EN34_MASK)

#define VFCCU_2_FHFLTENC0_1_EN35_MASK            (0x8U)
#define VFCCU_2_FHFLTENC0_1_EN35_SHIFT           (3U)
#define VFCCU_2_FHFLTENC0_1_EN35_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_1_EN35(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_1_EN35_SHIFT)) & VFCCU_2_FHFLTENC0_1_EN35_MASK)

#define VFCCU_2_FHFLTENC0_1_EN36_MASK            (0x10U)
#define VFCCU_2_FHFLTENC0_1_EN36_SHIFT           (4U)
#define VFCCU_2_FHFLTENC0_1_EN36_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_1_EN36(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_1_EN36_SHIFT)) & VFCCU_2_FHFLTENC0_1_EN36_MASK)

#define VFCCU_2_FHFLTENC0_1_EN37_MASK            (0x20U)
#define VFCCU_2_FHFLTENC0_1_EN37_SHIFT           (5U)
#define VFCCU_2_FHFLTENC0_1_EN37_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_1_EN37(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_1_EN37_SHIFT)) & VFCCU_2_FHFLTENC0_1_EN37_MASK)

