zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
#define VFCCU_2_FHFLTENC0_1_EN63_MASK            (0x80000000U)
#define VFCCU_2_FHFLTENC0_1_EN63_SHIFT           (31U)
#define VFCCU_2_FHFLTENC0_1_EN63_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_1_EN63(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_1_EN63_SHIFT)) & VFCCU_2_FHFLTENC0_1_EN63_MASK)
/*! @} */

/*! @name FHFLTENC0_2 - Fault Enable */
/*! @{ */

#define VFCCU_2_FHFLTENC0_2_EN64_MASK            (0x1U)
#define VFCCU_2_FHFLTENC0_2_EN64_SHIFT           (0U)
#define VFCCU_2_FHFLTENC0_2_EN64_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN64(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN64_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN64_MASK)

#define VFCCU_2_FHFLTENC0_2_EN65_MASK            (0x2U)
#define VFCCU_2_FHFLTENC0_2_EN65_SHIFT           (1U)
#define VFCCU_2_FHFLTENC0_2_EN65_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN65(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN65_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN65_MASK)

#define VFCCU_2_FHFLTENC0_2_EN66_MASK            (0x4U)
#define VFCCU_2_FHFLTENC0_2_EN66_SHIFT           (2U)
#define VFCCU_2_FHFLTENC0_2_EN66_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN66(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN66_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN66_MASK)

#define VFCCU_2_FHFLTENC0_2_EN67_MASK            (0x8U)
#define VFCCU_2_FHFLTENC0_2_EN67_SHIFT           (3U)
#define VFCCU_2_FHFLTENC0_2_EN67_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN67(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN67_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN67_MASK)

#define VFCCU_2_FHFLTENC0_2_EN68_MASK            (0x10U)
#define VFCCU_2_FHFLTENC0_2_EN68_SHIFT           (4U)
#define VFCCU_2_FHFLTENC0_2_EN68_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN68(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN68_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN68_MASK)

#define VFCCU_2_FHFLTENC0_2_EN69_MASK            (0x20U)
#define VFCCU_2_FHFLTENC0_2_EN69_SHIFT           (5U)
#define VFCCU_2_FHFLTENC0_2_EN69_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN69(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN69_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN69_MASK)

#define VFCCU_2_FHFLTENC0_2_EN70_MASK            (0x40U)
#define VFCCU_2_FHFLTENC0_2_EN70_SHIFT           (6U)
#define VFCCU_2_FHFLTENC0_2_EN70_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN70(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN70_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN70_MASK)

#define VFCCU_2_FHFLTENC0_2_EN71_MASK            (0x80U)
#define VFCCU_2_FHFLTENC0_2_EN71_SHIFT           (7U)
#define VFCCU_2_FHFLTENC0_2_EN71_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN71(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN71_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN71_MASK)

#define VFCCU_2_FHFLTENC0_2_EN72_MASK            (0x100U)
#define VFCCU_2_FHFLTENC0_2_EN72_SHIFT           (8U)
#define VFCCU_2_FHFLTENC0_2_EN72_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN72(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN72_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN72_MASK)

#define VFCCU_2_FHFLTENC0_2_EN73_MASK            (0x200U)
#define VFCCU_2_FHFLTENC0_2_EN73_SHIFT           (9U)
#define VFCCU_2_FHFLTENC0_2_EN73_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN73(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN73_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN73_MASK)

#define VFCCU_2_FHFLTENC0_2_EN74_MASK            (0x400U)
#define VFCCU_2_FHFLTENC0_2_EN74_SHIFT           (10U)
#define VFCCU_2_FHFLTENC0_2_EN74_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN74(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN74_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN74_MASK)

#define VFCCU_2_FHFLTENC0_2_EN75_MASK            (0x800U)
#define VFCCU_2_FHFLTENC0_2_EN75_SHIFT           (11U)
#define VFCCU_2_FHFLTENC0_2_EN75_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN75(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN75_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN75_MASK)

#define VFCCU_2_FHFLTENC0_2_EN76_MASK            (0x1000U)
#define VFCCU_2_FHFLTENC0_2_EN76_SHIFT           (12U)
#define VFCCU_2_FHFLTENC0_2_EN76_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN76(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN76_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN76_MASK)

#define VFCCU_2_FHFLTENC0_2_EN77_MASK            (0x2000U)
#define VFCCU_2_FHFLTENC0_2_EN77_SHIFT           (13U)
#define VFCCU_2_FHFLTENC0_2_EN77_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN77(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN77_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN77_MASK)

#define VFCCU_2_FHFLTENC0_2_EN78_MASK            (0x4000U)
#define VFCCU_2_FHFLTENC0_2_EN78_SHIFT           (14U)
#define VFCCU_2_FHFLTENC0_2_EN78_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN78(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN78_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN78_MASK)

#define VFCCU_2_FHFLTENC0_2_EN79_MASK            (0x8000U)
#define VFCCU_2_FHFLTENC0_2_EN79_SHIFT           (15U)
#define VFCCU_2_FHFLTENC0_2_EN79_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN79(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN79_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN79_MASK)

#define VFCCU_2_FHFLTENC0_2_EN80_MASK            (0x10000U)
#define VFCCU_2_FHFLTENC0_2_EN80_SHIFT           (16U)
#define VFCCU_2_FHFLTENC0_2_EN80_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN80(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN80_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN80_MASK)

#define VFCCU_2_FHFLTENC0_2_EN81_MASK            (0x20000U)
#define VFCCU_2_FHFLTENC0_2_EN81_SHIFT           (17U)
#define VFCCU_2_FHFLTENC0_2_EN81_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN81(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN81_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN81_MASK)

#define VFCCU_2_FHFLTENC0_2_EN82_MASK            (0x40000U)
#define VFCCU_2_FHFLTENC0_2_EN82_SHIFT           (18U)
#define VFCCU_2_FHFLTENC0_2_EN82_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN82(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN82_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN82_MASK)

#define VFCCU_2_FHFLTENC0_2_EN83_MASK            (0x80000U)
#define VFCCU_2_FHFLTENC0_2_EN83_SHIFT           (19U)
#define VFCCU_2_FHFLTENC0_2_EN83_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN83(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN83_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN83_MASK)

#define VFCCU_2_FHFLTENC0_2_EN84_MASK            (0x100000U)
#define VFCCU_2_FHFLTENC0_2_EN84_SHIFT           (20U)
#define VFCCU_2_FHFLTENC0_2_EN84_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN84(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN84_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN84_MASK)

#define VFCCU_2_FHFLTENC0_2_EN85_MASK            (0x200000U)
#define VFCCU_2_FHFLTENC0_2_EN85_SHIFT           (21U)
#define VFCCU_2_FHFLTENC0_2_EN85_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN85(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN85_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN85_MASK)

#define VFCCU_2_FHFLTENC0_2_EN86_MASK            (0x400000U)
#define VFCCU_2_FHFLTENC0_2_EN86_SHIFT           (22U)
#define VFCCU_2_FHFLTENC0_2_EN86_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN86(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN86_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN86_MASK)

#define VFCCU_2_FHFLTENC0_2_EN87_MASK            (0x800000U)
#define VFCCU_2_FHFLTENC0_2_EN87_SHIFT           (23U)
#define VFCCU_2_FHFLTENC0_2_EN87_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN87(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN87_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN87_MASK)

#define VFCCU_2_FHFLTENC0_2_EN88_MASK            (0x1000000U)
#define VFCCU_2_FHFLTENC0_2_EN88_SHIFT           (24U)
#define VFCCU_2_FHFLTENC0_2_EN88_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN88(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN88_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN88_MASK)

#define VFCCU_2_FHFLTENC0_2_EN89_MASK            (0x2000000U)
#define VFCCU_2_FHFLTENC0_2_EN89_SHIFT           (25U)
#define VFCCU_2_FHFLTENC0_2_EN89_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN89(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN89_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN89_MASK)

#define VFCCU_2_FHFLTENC0_2_EN90_MASK            (0x4000000U)
#define VFCCU_2_FHFLTENC0_2_EN90_SHIFT           (26U)
#define VFCCU_2_FHFLTENC0_2_EN90_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN90(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN90_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN90_MASK)

#define VFCCU_2_FHFLTENC0_2_EN91_MASK            (0x8000000U)
#define VFCCU_2_FHFLTENC0_2_EN91_SHIFT           (27U)
#define VFCCU_2_FHFLTENC0_2_EN91_WIDTH           (1U)
#define VFCCU_2_FHFLTENC0_2_EN91(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_2_EN91_SHIFT)) & VFCCU_2_FHFLTENC0_2_EN91_MASK)

