zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
#define VFCCU_2_FHFLTENC0_3_EN112_MASK           (0x10000U)
#define VFCCU_2_FHFLTENC0_3_EN112_SHIFT          (16U)
#define VFCCU_2_FHFLTENC0_3_EN112_WIDTH          (1U)
#define VFCCU_2_FHFLTENC0_3_EN112(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_3_EN112_SHIFT)) & VFCCU_2_FHFLTENC0_3_EN112_MASK)

#define VFCCU_2_FHFLTENC0_3_EN113_MASK           (0x20000U)
#define VFCCU_2_FHFLTENC0_3_EN113_SHIFT          (17U)
#define VFCCU_2_FHFLTENC0_3_EN113_WIDTH          (1U)
#define VFCCU_2_FHFLTENC0_3_EN113(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_3_EN113_SHIFT)) & VFCCU_2_FHFLTENC0_3_EN113_MASK)

#define VFCCU_2_FHFLTENC0_3_EN114_MASK           (0x40000U)
#define VFCCU_2_FHFLTENC0_3_EN114_SHIFT          (18U)
#define VFCCU_2_FHFLTENC0_3_EN114_WIDTH          (1U)
#define VFCCU_2_FHFLTENC0_3_EN114(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_3_EN114_SHIFT)) & VFCCU_2_FHFLTENC0_3_EN114_MASK)

#define VFCCU_2_FHFLTENC0_3_EN115_MASK           (0x80000U)
#define VFCCU_2_FHFLTENC0_3_EN115_SHIFT          (19U)
#define VFCCU_2_FHFLTENC0_3_EN115_WIDTH          (1U)
#define VFCCU_2_FHFLTENC0_3_EN115(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_3_EN115_SHIFT)) & VFCCU_2_FHFLTENC0_3_EN115_MASK)

#define VFCCU_2_FHFLTENC0_3_EN116_MASK           (0x100000U)
#define VFCCU_2_FHFLTENC0_3_EN116_SHIFT          (20U)
#define VFCCU_2_FHFLTENC0_3_EN116_WIDTH          (1U)
#define VFCCU_2_FHFLTENC0_3_EN116(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_3_EN116_SHIFT)) & VFCCU_2_FHFLTENC0_3_EN116_MASK)

#define VFCCU_2_FHFLTENC0_3_EN117_MASK           (0x200000U)
#define VFCCU_2_FHFLTENC0_3_EN117_SHIFT          (21U)
#define VFCCU_2_FHFLTENC0_3_EN117_WIDTH          (1U)
#define VFCCU_2_FHFLTENC0_3_EN117(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_3_EN117_SHIFT)) & VFCCU_2_FHFLTENC0_3_EN117_MASK)

#define VFCCU_2_FHFLTENC0_3_EN118_MASK           (0x400000U)
#define VFCCU_2_FHFLTENC0_3_EN118_SHIFT          (22U)
#define VFCCU_2_FHFLTENC0_3_EN118_WIDTH          (1U)
#define VFCCU_2_FHFLTENC0_3_EN118(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_3_EN118_SHIFT)) & VFCCU_2_FHFLTENC0_3_EN118_MASK)

#define VFCCU_2_FHFLTENC0_3_EN119_MASK           (0x800000U)
#define VFCCU_2_FHFLTENC0_3_EN119_SHIFT          (23U)
#define VFCCU_2_FHFLTENC0_3_EN119_WIDTH          (1U)
#define VFCCU_2_FHFLTENC0_3_EN119(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_3_EN119_SHIFT)) & VFCCU_2_FHFLTENC0_3_EN119_MASK)

#define VFCCU_2_FHFLTENC0_3_EN120_MASK           (0x1000000U)
#define VFCCU_2_FHFLTENC0_3_EN120_SHIFT          (24U)
#define VFCCU_2_FHFLTENC0_3_EN120_WIDTH          (1U)
#define VFCCU_2_FHFLTENC0_3_EN120(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_3_EN120_SHIFT)) & VFCCU_2_FHFLTENC0_3_EN120_MASK)

#define VFCCU_2_FHFLTENC0_3_EN121_MASK           (0x2000000U)
#define VFCCU_2_FHFLTENC0_3_EN121_SHIFT          (25U)
#define VFCCU_2_FHFLTENC0_3_EN121_WIDTH          (1U)
#define VFCCU_2_FHFLTENC0_3_EN121(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_3_EN121_SHIFT)) & VFCCU_2_FHFLTENC0_3_EN121_MASK)

#define VFCCU_2_FHFLTENC0_3_EN122_MASK           (0x4000000U)
#define VFCCU_2_FHFLTENC0_3_EN122_SHIFT          (26U)
#define VFCCU_2_FHFLTENC0_3_EN122_WIDTH          (1U)
#define VFCCU_2_FHFLTENC0_3_EN122(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_3_EN122_SHIFT)) & VFCCU_2_FHFLTENC0_3_EN122_MASK)

#define VFCCU_2_FHFLTENC0_3_EN123_MASK           (0x8000000U)
#define VFCCU_2_FHFLTENC0_3_EN123_SHIFT          (27U)
#define VFCCU_2_FHFLTENC0_3_EN123_WIDTH          (1U)
#define VFCCU_2_FHFLTENC0_3_EN123(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_3_EN123_SHIFT)) & VFCCU_2_FHFLTENC0_3_EN123_MASK)

#define VFCCU_2_FHFLTENC0_3_EN124_MASK           (0x10000000U)
#define VFCCU_2_FHFLTENC0_3_EN124_SHIFT          (28U)
#define VFCCU_2_FHFLTENC0_3_EN124_WIDTH          (1U)
#define VFCCU_2_FHFLTENC0_3_EN124(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_3_EN124_SHIFT)) & VFCCU_2_FHFLTENC0_3_EN124_MASK)

#define VFCCU_2_FHFLTENC0_3_EN125_MASK           (0x20000000U)
#define VFCCU_2_FHFLTENC0_3_EN125_SHIFT          (29U)
#define VFCCU_2_FHFLTENC0_3_EN125_WIDTH          (1U)
#define VFCCU_2_FHFLTENC0_3_EN125(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_3_EN125_SHIFT)) & VFCCU_2_FHFLTENC0_3_EN125_MASK)

#define VFCCU_2_FHFLTENC0_3_EN126_MASK           (0x40000000U)
#define VFCCU_2_FHFLTENC0_3_EN126_SHIFT          (30U)
#define VFCCU_2_FHFLTENC0_3_EN126_WIDTH          (1U)
#define VFCCU_2_FHFLTENC0_3_EN126(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_3_EN126_SHIFT)) & VFCCU_2_FHFLTENC0_3_EN126_MASK)

#define VFCCU_2_FHFLTENC0_3_EN127_MASK           (0x80000000U)
#define VFCCU_2_FHFLTENC0_3_EN127_SHIFT          (31U)
#define VFCCU_2_FHFLTENC0_3_EN127_WIDTH          (1U)
#define VFCCU_2_FHFLTENC0_3_EN127(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTENC0_3_EN127_SHIFT)) & VFCCU_2_FHFLTENC0_3_EN127_MASK)
/*! @} */

/*! @name FHFLTS0_0 - Fault Status */
/*! @{ */

#define VFCCU_2_FHFLTS0_0_STAT0_MASK             (0x1U)
#define VFCCU_2_FHFLTS0_0_STAT0_SHIFT            (0U)
#define VFCCU_2_FHFLTS0_0_STAT0_WIDTH            (1U)
#define VFCCU_2_FHFLTS0_0_STAT0(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_0_STAT0_SHIFT)) & VFCCU_2_FHFLTS0_0_STAT0_MASK)

#define VFCCU_2_FHFLTS0_0_STAT1_MASK             (0x2U)
#define VFCCU_2_FHFLTS0_0_STAT1_SHIFT            (1U)
#define VFCCU_2_FHFLTS0_0_STAT1_WIDTH            (1U)
#define VFCCU_2_FHFLTS0_0_STAT1(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_0_STAT1_SHIFT)) & VFCCU_2_FHFLTS0_0_STAT1_MASK)

#define VFCCU_2_FHFLTS0_0_STAT2_MASK             (0x4U)
#define VFCCU_2_FHFLTS0_0_STAT2_SHIFT            (2U)
#define VFCCU_2_FHFLTS0_0_STAT2_WIDTH            (1U)
#define VFCCU_2_FHFLTS0_0_STAT2(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_0_STAT2_SHIFT)) & VFCCU_2_FHFLTS0_0_STAT2_MASK)

#define VFCCU_2_FHFLTS0_0_STAT3_MASK             (0x8U)
#define VFCCU_2_FHFLTS0_0_STAT3_SHIFT            (3U)
#define VFCCU_2_FHFLTS0_0_STAT3_WIDTH            (1U)
#define VFCCU_2_FHFLTS0_0_STAT3(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_0_STAT3_SHIFT)) & VFCCU_2_FHFLTS0_0_STAT3_MASK)

#define VFCCU_2_FHFLTS0_0_STAT4_MASK             (0x10U)
#define VFCCU_2_FHFLTS0_0_STAT4_SHIFT            (4U)
#define VFCCU_2_FHFLTS0_0_STAT4_WIDTH            (1U)
#define VFCCU_2_FHFLTS0_0_STAT4(x)               (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_0_STAT4_SHIFT)) & VFCCU_2_FHFLTS0_0_STAT4_MASK)

