zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
#define VFCCU_2_FHFLTS0_1_STAT45_MASK            (0x2000U)
#define VFCCU_2_FHFLTS0_1_STAT45_SHIFT           (13U)
#define VFCCU_2_FHFLTS0_1_STAT45_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT45(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT45_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT45_MASK)

#define VFCCU_2_FHFLTS0_1_STAT46_MASK            (0x4000U)
#define VFCCU_2_FHFLTS0_1_STAT46_SHIFT           (14U)
#define VFCCU_2_FHFLTS0_1_STAT46_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT46(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT46_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT46_MASK)

#define VFCCU_2_FHFLTS0_1_STAT47_MASK            (0x8000U)
#define VFCCU_2_FHFLTS0_1_STAT47_SHIFT           (15U)
#define VFCCU_2_FHFLTS0_1_STAT47_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT47(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT47_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT47_MASK)

#define VFCCU_2_FHFLTS0_1_STAT48_MASK            (0x10000U)
#define VFCCU_2_FHFLTS0_1_STAT48_SHIFT           (16U)
#define VFCCU_2_FHFLTS0_1_STAT48_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT48(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT48_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT48_MASK)

#define VFCCU_2_FHFLTS0_1_STAT49_MASK            (0x20000U)
#define VFCCU_2_FHFLTS0_1_STAT49_SHIFT           (17U)
#define VFCCU_2_FHFLTS0_1_STAT49_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT49(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT49_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT49_MASK)

#define VFCCU_2_FHFLTS0_1_STAT50_MASK            (0x40000U)
#define VFCCU_2_FHFLTS0_1_STAT50_SHIFT           (18U)
#define VFCCU_2_FHFLTS0_1_STAT50_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT50(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT50_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT50_MASK)

#define VFCCU_2_FHFLTS0_1_STAT51_MASK            (0x80000U)
#define VFCCU_2_FHFLTS0_1_STAT51_SHIFT           (19U)
#define VFCCU_2_FHFLTS0_1_STAT51_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT51(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT51_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT51_MASK)

#define VFCCU_2_FHFLTS0_1_STAT52_MASK            (0x100000U)
#define VFCCU_2_FHFLTS0_1_STAT52_SHIFT           (20U)
#define VFCCU_2_FHFLTS0_1_STAT52_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT52(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT52_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT52_MASK)

#define VFCCU_2_FHFLTS0_1_STAT53_MASK            (0x200000U)
#define VFCCU_2_FHFLTS0_1_STAT53_SHIFT           (21U)
#define VFCCU_2_FHFLTS0_1_STAT53_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT53(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT53_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT53_MASK)

#define VFCCU_2_FHFLTS0_1_STAT54_MASK            (0x400000U)
#define VFCCU_2_FHFLTS0_1_STAT54_SHIFT           (22U)
#define VFCCU_2_FHFLTS0_1_STAT54_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT54(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT54_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT54_MASK)

#define VFCCU_2_FHFLTS0_1_STAT55_MASK            (0x800000U)
#define VFCCU_2_FHFLTS0_1_STAT55_SHIFT           (23U)
#define VFCCU_2_FHFLTS0_1_STAT55_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT55(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT55_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT55_MASK)

#define VFCCU_2_FHFLTS0_1_STAT56_MASK            (0x1000000U)
#define VFCCU_2_FHFLTS0_1_STAT56_SHIFT           (24U)
#define VFCCU_2_FHFLTS0_1_STAT56_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT56(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT56_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT56_MASK)

#define VFCCU_2_FHFLTS0_1_STAT57_MASK            (0x2000000U)
#define VFCCU_2_FHFLTS0_1_STAT57_SHIFT           (25U)
#define VFCCU_2_FHFLTS0_1_STAT57_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT57(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT57_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT57_MASK)

#define VFCCU_2_FHFLTS0_1_STAT58_MASK            (0x4000000U)
#define VFCCU_2_FHFLTS0_1_STAT58_SHIFT           (26U)
#define VFCCU_2_FHFLTS0_1_STAT58_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT58(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT58_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT58_MASK)

#define VFCCU_2_FHFLTS0_1_STAT59_MASK            (0x8000000U)
#define VFCCU_2_FHFLTS0_1_STAT59_SHIFT           (27U)
#define VFCCU_2_FHFLTS0_1_STAT59_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT59(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT59_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT59_MASK)

#define VFCCU_2_FHFLTS0_1_STAT60_MASK            (0x10000000U)
#define VFCCU_2_FHFLTS0_1_STAT60_SHIFT           (28U)
#define VFCCU_2_FHFLTS0_1_STAT60_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT60(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT60_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT60_MASK)

#define VFCCU_2_FHFLTS0_1_STAT61_MASK            (0x20000000U)
#define VFCCU_2_FHFLTS0_1_STAT61_SHIFT           (29U)
#define VFCCU_2_FHFLTS0_1_STAT61_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT61(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT61_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT61_MASK)

#define VFCCU_2_FHFLTS0_1_STAT62_MASK            (0x40000000U)
#define VFCCU_2_FHFLTS0_1_STAT62_SHIFT           (30U)
#define VFCCU_2_FHFLTS0_1_STAT62_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT62(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT62_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT62_MASK)

#define VFCCU_2_FHFLTS0_1_STAT63_MASK            (0x80000000U)
#define VFCCU_2_FHFLTS0_1_STAT63_SHIFT           (31U)
#define VFCCU_2_FHFLTS0_1_STAT63_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_1_STAT63(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_1_STAT63_SHIFT)) & VFCCU_2_FHFLTS0_1_STAT63_MASK)
/*! @} */

