zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
/*! @name FHFLTS0_2 - Fault Status */
/*! @{ */

#define VFCCU_2_FHFLTS0_2_STAT64_MASK            (0x1U)
#define VFCCU_2_FHFLTS0_2_STAT64_SHIFT           (0U)
#define VFCCU_2_FHFLTS0_2_STAT64_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT64(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT64_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT64_MASK)

#define VFCCU_2_FHFLTS0_2_STAT65_MASK            (0x2U)
#define VFCCU_2_FHFLTS0_2_STAT65_SHIFT           (1U)
#define VFCCU_2_FHFLTS0_2_STAT65_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT65(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT65_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT65_MASK)

#define VFCCU_2_FHFLTS0_2_STAT66_MASK            (0x4U)
#define VFCCU_2_FHFLTS0_2_STAT66_SHIFT           (2U)
#define VFCCU_2_FHFLTS0_2_STAT66_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT66(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT66_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT66_MASK)

#define VFCCU_2_FHFLTS0_2_STAT67_MASK            (0x8U)
#define VFCCU_2_FHFLTS0_2_STAT67_SHIFT           (3U)
#define VFCCU_2_FHFLTS0_2_STAT67_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT67(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT67_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT67_MASK)

#define VFCCU_2_FHFLTS0_2_STAT68_MASK            (0x10U)
#define VFCCU_2_FHFLTS0_2_STAT68_SHIFT           (4U)
#define VFCCU_2_FHFLTS0_2_STAT68_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT68(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT68_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT68_MASK)

#define VFCCU_2_FHFLTS0_2_STAT69_MASK            (0x20U)
#define VFCCU_2_FHFLTS0_2_STAT69_SHIFT           (5U)
#define VFCCU_2_FHFLTS0_2_STAT69_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT69(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT69_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT69_MASK)

#define VFCCU_2_FHFLTS0_2_STAT70_MASK            (0x40U)
#define VFCCU_2_FHFLTS0_2_STAT70_SHIFT           (6U)
#define VFCCU_2_FHFLTS0_2_STAT70_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT70(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT70_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT70_MASK)

#define VFCCU_2_FHFLTS0_2_STAT71_MASK            (0x80U)
#define VFCCU_2_FHFLTS0_2_STAT71_SHIFT           (7U)
#define VFCCU_2_FHFLTS0_2_STAT71_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT71(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT71_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT71_MASK)

#define VFCCU_2_FHFLTS0_2_STAT72_MASK            (0x100U)
#define VFCCU_2_FHFLTS0_2_STAT72_SHIFT           (8U)
#define VFCCU_2_FHFLTS0_2_STAT72_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT72(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT72_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT72_MASK)

#define VFCCU_2_FHFLTS0_2_STAT73_MASK            (0x200U)
#define VFCCU_2_FHFLTS0_2_STAT73_SHIFT           (9U)
#define VFCCU_2_FHFLTS0_2_STAT73_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT73(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT73_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT73_MASK)

#define VFCCU_2_FHFLTS0_2_STAT74_MASK            (0x400U)
#define VFCCU_2_FHFLTS0_2_STAT74_SHIFT           (10U)
#define VFCCU_2_FHFLTS0_2_STAT74_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT74(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT74_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT74_MASK)

#define VFCCU_2_FHFLTS0_2_STAT75_MASK            (0x800U)
#define VFCCU_2_FHFLTS0_2_STAT75_SHIFT           (11U)
#define VFCCU_2_FHFLTS0_2_STAT75_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT75(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT75_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT75_MASK)

#define VFCCU_2_FHFLTS0_2_STAT76_MASK            (0x1000U)
#define VFCCU_2_FHFLTS0_2_STAT76_SHIFT           (12U)
#define VFCCU_2_FHFLTS0_2_STAT76_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT76(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT76_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT76_MASK)

#define VFCCU_2_FHFLTS0_2_STAT77_MASK            (0x2000U)
#define VFCCU_2_FHFLTS0_2_STAT77_SHIFT           (13U)
#define VFCCU_2_FHFLTS0_2_STAT77_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT77(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT77_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT77_MASK)

#define VFCCU_2_FHFLTS0_2_STAT78_MASK            (0x4000U)
#define VFCCU_2_FHFLTS0_2_STAT78_SHIFT           (14U)
#define VFCCU_2_FHFLTS0_2_STAT78_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT78(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT78_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT78_MASK)

#define VFCCU_2_FHFLTS0_2_STAT79_MASK            (0x8000U)
#define VFCCU_2_FHFLTS0_2_STAT79_SHIFT           (15U)
#define VFCCU_2_FHFLTS0_2_STAT79_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT79(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT79_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT79_MASK)

#define VFCCU_2_FHFLTS0_2_STAT80_MASK            (0x10000U)
#define VFCCU_2_FHFLTS0_2_STAT80_SHIFT           (16U)
#define VFCCU_2_FHFLTS0_2_STAT80_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT80(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT80_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT80_MASK)

#define VFCCU_2_FHFLTS0_2_STAT81_MASK            (0x20000U)
#define VFCCU_2_FHFLTS0_2_STAT81_SHIFT           (17U)
#define VFCCU_2_FHFLTS0_2_STAT81_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT81(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT81_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT81_MASK)

#define VFCCU_2_FHFLTS0_2_STAT82_MASK            (0x40000U)
#define VFCCU_2_FHFLTS0_2_STAT82_SHIFT           (18U)
#define VFCCU_2_FHFLTS0_2_STAT82_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT82(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT82_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT82_MASK)

#define VFCCU_2_FHFLTS0_2_STAT83_MASK            (0x80000U)
#define VFCCU_2_FHFLTS0_2_STAT83_SHIFT           (19U)
#define VFCCU_2_FHFLTS0_2_STAT83_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT83(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT83_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT83_MASK)

#define VFCCU_2_FHFLTS0_2_STAT84_MASK            (0x100000U)
#define VFCCU_2_FHFLTS0_2_STAT84_SHIFT           (20U)
#define VFCCU_2_FHFLTS0_2_STAT84_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT84(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT84_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT84_MASK)

#define VFCCU_2_FHFLTS0_2_STAT85_MASK            (0x200000U)
#define VFCCU_2_FHFLTS0_2_STAT85_SHIFT           (21U)
#define VFCCU_2_FHFLTS0_2_STAT85_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT85(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT85_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT85_MASK)

#define VFCCU_2_FHFLTS0_2_STAT86_MASK            (0x400000U)
#define VFCCU_2_FHFLTS0_2_STAT86_SHIFT           (22U)
#define VFCCU_2_FHFLTS0_2_STAT86_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT86(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT86_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT86_MASK)

#define VFCCU_2_FHFLTS0_2_STAT87_MASK            (0x800000U)
#define VFCCU_2_FHFLTS0_2_STAT87_SHIFT           (23U)
#define VFCCU_2_FHFLTS0_2_STAT87_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT87(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT87_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT87_MASK)

#define VFCCU_2_FHFLTS0_2_STAT88_MASK            (0x1000000U)
#define VFCCU_2_FHFLTS0_2_STAT88_SHIFT           (24U)
#define VFCCU_2_FHFLTS0_2_STAT88_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT88(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT88_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT88_MASK)

