zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
#define VFCCU_2_FHFLTS0_2_STAT89_MASK            (0x2000000U)
#define VFCCU_2_FHFLTS0_2_STAT89_SHIFT           (25U)
#define VFCCU_2_FHFLTS0_2_STAT89_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT89(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT89_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT89_MASK)

#define VFCCU_2_FHFLTS0_2_STAT90_MASK            (0x4000000U)
#define VFCCU_2_FHFLTS0_2_STAT90_SHIFT           (26U)
#define VFCCU_2_FHFLTS0_2_STAT90_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT90(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT90_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT90_MASK)

#define VFCCU_2_FHFLTS0_2_STAT91_MASK            (0x8000000U)
#define VFCCU_2_FHFLTS0_2_STAT91_SHIFT           (27U)
#define VFCCU_2_FHFLTS0_2_STAT91_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT91(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT91_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT91_MASK)

#define VFCCU_2_FHFLTS0_2_STAT92_MASK            (0x10000000U)
#define VFCCU_2_FHFLTS0_2_STAT92_SHIFT           (28U)
#define VFCCU_2_FHFLTS0_2_STAT92_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT92(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT92_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT92_MASK)

#define VFCCU_2_FHFLTS0_2_STAT93_MASK            (0x20000000U)
#define VFCCU_2_FHFLTS0_2_STAT93_SHIFT           (29U)
#define VFCCU_2_FHFLTS0_2_STAT93_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT93(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT93_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT93_MASK)

#define VFCCU_2_FHFLTS0_2_STAT94_MASK            (0x40000000U)
#define VFCCU_2_FHFLTS0_2_STAT94_SHIFT           (30U)
#define VFCCU_2_FHFLTS0_2_STAT94_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT94(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT94_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT94_MASK)

#define VFCCU_2_FHFLTS0_2_STAT95_MASK            (0x80000000U)
#define VFCCU_2_FHFLTS0_2_STAT95_SHIFT           (31U)
#define VFCCU_2_FHFLTS0_2_STAT95_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_2_STAT95(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_2_STAT95_SHIFT)) & VFCCU_2_FHFLTS0_2_STAT95_MASK)
/*! @} */

/*! @name FHFLTS0_3 - Fault Status */
/*! @{ */

#define VFCCU_2_FHFLTS0_3_STAT96_MASK            (0x1U)
#define VFCCU_2_FHFLTS0_3_STAT96_SHIFT           (0U)
#define VFCCU_2_FHFLTS0_3_STAT96_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_3_STAT96(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT96_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT96_MASK)

#define VFCCU_2_FHFLTS0_3_STAT97_MASK            (0x2U)
#define VFCCU_2_FHFLTS0_3_STAT97_SHIFT           (1U)
#define VFCCU_2_FHFLTS0_3_STAT97_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_3_STAT97(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT97_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT97_MASK)

#define VFCCU_2_FHFLTS0_3_STAT98_MASK            (0x4U)
#define VFCCU_2_FHFLTS0_3_STAT98_SHIFT           (2U)
#define VFCCU_2_FHFLTS0_3_STAT98_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_3_STAT98(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT98_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT98_MASK)

#define VFCCU_2_FHFLTS0_3_STAT99_MASK            (0x8U)
#define VFCCU_2_FHFLTS0_3_STAT99_SHIFT           (3U)
#define VFCCU_2_FHFLTS0_3_STAT99_WIDTH           (1U)
#define VFCCU_2_FHFLTS0_3_STAT99(x)              (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT99_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT99_MASK)

#define VFCCU_2_FHFLTS0_3_STAT100_MASK           (0x10U)
#define VFCCU_2_FHFLTS0_3_STAT100_SHIFT          (4U)
#define VFCCU_2_FHFLTS0_3_STAT100_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT100(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT100_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT100_MASK)

#define VFCCU_2_FHFLTS0_3_STAT101_MASK           (0x20U)
#define VFCCU_2_FHFLTS0_3_STAT101_SHIFT          (5U)
#define VFCCU_2_FHFLTS0_3_STAT101_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT101(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT101_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT101_MASK)

#define VFCCU_2_FHFLTS0_3_STAT102_MASK           (0x40U)
#define VFCCU_2_FHFLTS0_3_STAT102_SHIFT          (6U)
#define VFCCU_2_FHFLTS0_3_STAT102_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT102(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT102_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT102_MASK)

#define VFCCU_2_FHFLTS0_3_STAT103_MASK           (0x80U)
#define VFCCU_2_FHFLTS0_3_STAT103_SHIFT          (7U)
#define VFCCU_2_FHFLTS0_3_STAT103_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT103(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT103_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT103_MASK)

#define VFCCU_2_FHFLTS0_3_STAT104_MASK           (0x100U)
#define VFCCU_2_FHFLTS0_3_STAT104_SHIFT          (8U)
#define VFCCU_2_FHFLTS0_3_STAT104_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT104(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT104_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT104_MASK)

#define VFCCU_2_FHFLTS0_3_STAT105_MASK           (0x200U)
#define VFCCU_2_FHFLTS0_3_STAT105_SHIFT          (9U)
#define VFCCU_2_FHFLTS0_3_STAT105_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT105(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT105_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT105_MASK)

#define VFCCU_2_FHFLTS0_3_STAT106_MASK           (0x400U)
#define VFCCU_2_FHFLTS0_3_STAT106_SHIFT          (10U)
#define VFCCU_2_FHFLTS0_3_STAT106_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT106(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT106_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT106_MASK)

#define VFCCU_2_FHFLTS0_3_STAT107_MASK           (0x800U)
#define VFCCU_2_FHFLTS0_3_STAT107_SHIFT          (11U)
#define VFCCU_2_FHFLTS0_3_STAT107_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT107(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT107_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT107_MASK)

#define VFCCU_2_FHFLTS0_3_STAT108_MASK           (0x1000U)
#define VFCCU_2_FHFLTS0_3_STAT108_SHIFT          (12U)
#define VFCCU_2_FHFLTS0_3_STAT108_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT108(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT108_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT108_MASK)

