zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
#define VFCCU_2_FHFLTS0_3_STAT109_MASK           (0x2000U)
#define VFCCU_2_FHFLTS0_3_STAT109_SHIFT          (13U)
#define VFCCU_2_FHFLTS0_3_STAT109_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT109(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT109_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT109_MASK)

#define VFCCU_2_FHFLTS0_3_STAT110_MASK           (0x4000U)
#define VFCCU_2_FHFLTS0_3_STAT110_SHIFT          (14U)
#define VFCCU_2_FHFLTS0_3_STAT110_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT110(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT110_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT110_MASK)

#define VFCCU_2_FHFLTS0_3_STAT111_MASK           (0x8000U)
#define VFCCU_2_FHFLTS0_3_STAT111_SHIFT          (15U)
#define VFCCU_2_FHFLTS0_3_STAT111_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT111(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT111_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT111_MASK)

#define VFCCU_2_FHFLTS0_3_STAT112_MASK           (0x10000U)
#define VFCCU_2_FHFLTS0_3_STAT112_SHIFT          (16U)
#define VFCCU_2_FHFLTS0_3_STAT112_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT112(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT112_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT112_MASK)

#define VFCCU_2_FHFLTS0_3_STAT113_MASK           (0x20000U)
#define VFCCU_2_FHFLTS0_3_STAT113_SHIFT          (17U)
#define VFCCU_2_FHFLTS0_3_STAT113_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT113(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT113_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT113_MASK)

#define VFCCU_2_FHFLTS0_3_STAT114_MASK           (0x40000U)
#define VFCCU_2_FHFLTS0_3_STAT114_SHIFT          (18U)
#define VFCCU_2_FHFLTS0_3_STAT114_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT114(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT114_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT114_MASK)

#define VFCCU_2_FHFLTS0_3_STAT115_MASK           (0x80000U)
#define VFCCU_2_FHFLTS0_3_STAT115_SHIFT          (19U)
#define VFCCU_2_FHFLTS0_3_STAT115_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT115(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT115_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT115_MASK)

#define VFCCU_2_FHFLTS0_3_STAT116_MASK           (0x100000U)
#define VFCCU_2_FHFLTS0_3_STAT116_SHIFT          (20U)
#define VFCCU_2_FHFLTS0_3_STAT116_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT116(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT116_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT116_MASK)

#define VFCCU_2_FHFLTS0_3_STAT117_MASK           (0x200000U)
#define VFCCU_2_FHFLTS0_3_STAT117_SHIFT          (21U)
#define VFCCU_2_FHFLTS0_3_STAT117_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT117(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT117_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT117_MASK)

#define VFCCU_2_FHFLTS0_3_STAT118_MASK           (0x400000U)
#define VFCCU_2_FHFLTS0_3_STAT118_SHIFT          (22U)
#define VFCCU_2_FHFLTS0_3_STAT118_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT118(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT118_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT118_MASK)

#define VFCCU_2_FHFLTS0_3_STAT119_MASK           (0x800000U)
#define VFCCU_2_FHFLTS0_3_STAT119_SHIFT          (23U)
#define VFCCU_2_FHFLTS0_3_STAT119_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT119(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT119_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT119_MASK)

#define VFCCU_2_FHFLTS0_3_STAT120_MASK           (0x1000000U)
#define VFCCU_2_FHFLTS0_3_STAT120_SHIFT          (24U)
#define VFCCU_2_FHFLTS0_3_STAT120_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT120(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT120_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT120_MASK)

#define VFCCU_2_FHFLTS0_3_STAT121_MASK           (0x2000000U)
#define VFCCU_2_FHFLTS0_3_STAT121_SHIFT          (25U)
#define VFCCU_2_FHFLTS0_3_STAT121_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT121(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT121_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT121_MASK)

#define VFCCU_2_FHFLTS0_3_STAT122_MASK           (0x4000000U)
#define VFCCU_2_FHFLTS0_3_STAT122_SHIFT          (26U)
#define VFCCU_2_FHFLTS0_3_STAT122_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT122(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT122_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT122_MASK)

#define VFCCU_2_FHFLTS0_3_STAT123_MASK           (0x8000000U)
#define VFCCU_2_FHFLTS0_3_STAT123_SHIFT          (27U)
#define VFCCU_2_FHFLTS0_3_STAT123_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT123(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT123_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT123_MASK)

#define VFCCU_2_FHFLTS0_3_STAT124_MASK           (0x10000000U)
#define VFCCU_2_FHFLTS0_3_STAT124_SHIFT          (28U)
#define VFCCU_2_FHFLTS0_3_STAT124_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT124(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT124_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT124_MASK)

#define VFCCU_2_FHFLTS0_3_STAT125_MASK           (0x20000000U)
#define VFCCU_2_FHFLTS0_3_STAT125_SHIFT          (29U)
#define VFCCU_2_FHFLTS0_3_STAT125_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT125(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT125_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT125_MASK)

#define VFCCU_2_FHFLTS0_3_STAT126_MASK           (0x40000000U)
#define VFCCU_2_FHFLTS0_3_STAT126_SHIFT          (30U)
#define VFCCU_2_FHFLTS0_3_STAT126_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT126(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT126_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT126_MASK)

#define VFCCU_2_FHFLTS0_3_STAT127_MASK           (0x80000000U)
#define VFCCU_2_FHFLTS0_3_STAT127_SHIFT          (31U)
#define VFCCU_2_FHFLTS0_3_STAT127_WIDTH          (1U)
#define VFCCU_2_FHFLTS0_3_STAT127(x)             (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTS0_3_STAT127_SHIFT)) & VFCCU_2_FHFLTS0_3_STAT127_MASK)
/*! @} */

