zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
#define VFCCU_2_FHFLTRKC0_26_RKNSEL104_MASK      (0xFU)
#define VFCCU_2_FHFLTRKC0_26_RKNSEL104_SHIFT     (0U)
#define VFCCU_2_FHFLTRKC0_26_RKNSEL104_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_26_RKNSEL104(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_26_RKNSEL104_SHIFT)) & VFCCU_2_FHFLTRKC0_26_RKNSEL104_MASK)

#define VFCCU_2_FHFLTRKC0_26_RKNSEL105_MASK      (0xF00U)
#define VFCCU_2_FHFLTRKC0_26_RKNSEL105_SHIFT     (8U)
#define VFCCU_2_FHFLTRKC0_26_RKNSEL105_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_26_RKNSEL105(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_26_RKNSEL105_SHIFT)) & VFCCU_2_FHFLTRKC0_26_RKNSEL105_MASK)

#define VFCCU_2_FHFLTRKC0_26_RKNSEL106_MASK      (0xF0000U)
#define VFCCU_2_FHFLTRKC0_26_RKNSEL106_SHIFT     (16U)
#define VFCCU_2_FHFLTRKC0_26_RKNSEL106_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_26_RKNSEL106(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_26_RKNSEL106_SHIFT)) & VFCCU_2_FHFLTRKC0_26_RKNSEL106_MASK)

#define VFCCU_2_FHFLTRKC0_26_RKNSEL107_MASK      (0xF000000U)
#define VFCCU_2_FHFLTRKC0_26_RKNSEL107_SHIFT     (24U)
#define VFCCU_2_FHFLTRKC0_26_RKNSEL107_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_26_RKNSEL107(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_26_RKNSEL107_SHIFT)) & VFCCU_2_FHFLTRKC0_26_RKNSEL107_MASK)
/*! @} */

/*! @name FHFLTRKC0_27 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_2_FHFLTRKC0_27_RKNSEL108_MASK      (0xFU)
#define VFCCU_2_FHFLTRKC0_27_RKNSEL108_SHIFT     (0U)
#define VFCCU_2_FHFLTRKC0_27_RKNSEL108_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_27_RKNSEL108(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_27_RKNSEL108_SHIFT)) & VFCCU_2_FHFLTRKC0_27_RKNSEL108_MASK)

#define VFCCU_2_FHFLTRKC0_27_RKNSEL109_MASK      (0xF00U)
#define VFCCU_2_FHFLTRKC0_27_RKNSEL109_SHIFT     (8U)
#define VFCCU_2_FHFLTRKC0_27_RKNSEL109_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_27_RKNSEL109(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_27_RKNSEL109_SHIFT)) & VFCCU_2_FHFLTRKC0_27_RKNSEL109_MASK)

#define VFCCU_2_FHFLTRKC0_27_RKNSEL110_MASK      (0xF0000U)
#define VFCCU_2_FHFLTRKC0_27_RKNSEL110_SHIFT     (16U)
#define VFCCU_2_FHFLTRKC0_27_RKNSEL110_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_27_RKNSEL110(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_27_RKNSEL110_SHIFT)) & VFCCU_2_FHFLTRKC0_27_RKNSEL110_MASK)

#define VFCCU_2_FHFLTRKC0_27_RKNSEL111_MASK      (0xF000000U)
#define VFCCU_2_FHFLTRKC0_27_RKNSEL111_SHIFT     (24U)
#define VFCCU_2_FHFLTRKC0_27_RKNSEL111_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_27_RKNSEL111(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_27_RKNSEL111_SHIFT)) & VFCCU_2_FHFLTRKC0_27_RKNSEL111_MASK)
/*! @} */

/*! @name FHFLTRKC0_28 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_2_FHFLTRKC0_28_RKNSEL112_MASK      (0xFU)
#define VFCCU_2_FHFLTRKC0_28_RKNSEL112_SHIFT     (0U)
#define VFCCU_2_FHFLTRKC0_28_RKNSEL112_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_28_RKNSEL112(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_28_RKNSEL112_SHIFT)) & VFCCU_2_FHFLTRKC0_28_RKNSEL112_MASK)

#define VFCCU_2_FHFLTRKC0_28_RKNSEL113_MASK      (0xF00U)
#define VFCCU_2_FHFLTRKC0_28_RKNSEL113_SHIFT     (8U)
#define VFCCU_2_FHFLTRKC0_28_RKNSEL113_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_28_RKNSEL113(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_28_RKNSEL113_SHIFT)) & VFCCU_2_FHFLTRKC0_28_RKNSEL113_MASK)

#define VFCCU_2_FHFLTRKC0_28_RKNSEL114_MASK      (0xF0000U)
#define VFCCU_2_FHFLTRKC0_28_RKNSEL114_SHIFT     (16U)
#define VFCCU_2_FHFLTRKC0_28_RKNSEL114_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_28_RKNSEL114(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_28_RKNSEL114_SHIFT)) & VFCCU_2_FHFLTRKC0_28_RKNSEL114_MASK)

#define VFCCU_2_FHFLTRKC0_28_RKNSEL115_MASK      (0xF000000U)
#define VFCCU_2_FHFLTRKC0_28_RKNSEL115_SHIFT     (24U)
#define VFCCU_2_FHFLTRKC0_28_RKNSEL115_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_28_RKNSEL115(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_28_RKNSEL115_SHIFT)) & VFCCU_2_FHFLTRKC0_28_RKNSEL115_MASK)
/*! @} */

/*! @name FHFLTRKC0_29 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_2_FHFLTRKC0_29_RKNSEL116_MASK      (0xFU)
#define VFCCU_2_FHFLTRKC0_29_RKNSEL116_SHIFT     (0U)
#define VFCCU_2_FHFLTRKC0_29_RKNSEL116_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_29_RKNSEL116(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_29_RKNSEL116_SHIFT)) & VFCCU_2_FHFLTRKC0_29_RKNSEL116_MASK)

#define VFCCU_2_FHFLTRKC0_29_RKNSEL117_MASK      (0xF00U)
#define VFCCU_2_FHFLTRKC0_29_RKNSEL117_SHIFT     (8U)
#define VFCCU_2_FHFLTRKC0_29_RKNSEL117_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_29_RKNSEL117(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_29_RKNSEL117_SHIFT)) & VFCCU_2_FHFLTRKC0_29_RKNSEL117_MASK)

#define VFCCU_2_FHFLTRKC0_29_RKNSEL118_MASK      (0xF0000U)
#define VFCCU_2_FHFLTRKC0_29_RKNSEL118_SHIFT     (16U)
#define VFCCU_2_FHFLTRKC0_29_RKNSEL118_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_29_RKNSEL118(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_29_RKNSEL118_SHIFT)) & VFCCU_2_FHFLTRKC0_29_RKNSEL118_MASK)

#define VFCCU_2_FHFLTRKC0_29_RKNSEL119_MASK      (0xF000000U)
#define VFCCU_2_FHFLTRKC0_29_RKNSEL119_SHIFT     (24U)
#define VFCCU_2_FHFLTRKC0_29_RKNSEL119_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_29_RKNSEL119(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_29_RKNSEL119_SHIFT)) & VFCCU_2_FHFLTRKC0_29_RKNSEL119_MASK)
/*! @} */

/*! @name FHFLTRKC0_30 - Fault Reaction Set Configuration */
/*! @{ */

#define VFCCU_2_FHFLTRKC0_30_RKNSEL120_MASK      (0xFU)
#define VFCCU_2_FHFLTRKC0_30_RKNSEL120_SHIFT     (0U)
#define VFCCU_2_FHFLTRKC0_30_RKNSEL120_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_30_RKNSEL120(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_30_RKNSEL120_SHIFT)) & VFCCU_2_FHFLTRKC0_30_RKNSEL120_MASK)

#define VFCCU_2_FHFLTRKC0_30_RKNSEL121_MASK      (0xF00U)
#define VFCCU_2_FHFLTRKC0_30_RKNSEL121_SHIFT     (8U)
#define VFCCU_2_FHFLTRKC0_30_RKNSEL121_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_30_RKNSEL121(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_30_RKNSEL121_SHIFT)) & VFCCU_2_FHFLTRKC0_30_RKNSEL121_MASK)

#define VFCCU_2_FHFLTRKC0_30_RKNSEL122_MASK      (0xF0000U)
#define VFCCU_2_FHFLTRKC0_30_RKNSEL122_SHIFT     (16U)
#define VFCCU_2_FHFLTRKC0_30_RKNSEL122_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_30_RKNSEL122(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_30_RKNSEL122_SHIFT)) & VFCCU_2_FHFLTRKC0_30_RKNSEL122_MASK)

#define VFCCU_2_FHFLTRKC0_30_RKNSEL123_MASK      (0xF000000U)
#define VFCCU_2_FHFLTRKC0_30_RKNSEL123_SHIFT     (24U)
#define VFCCU_2_FHFLTRKC0_30_RKNSEL123_WIDTH     (4U)
#define VFCCU_2_FHFLTRKC0_30_RKNSEL123(x)        (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHFLTRKC0_30_RKNSEL123_SHIFT)) & VFCCU_2_FHFLTRKC0_30_RKNSEL123_MASK)
/*! @} */

