zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_VFCCU_2.h
#define VFCCU_2_FHIMRKC0_150_RKNEN10_MASK        (0x400U)
#define VFCCU_2_FHIMRKC0_150_RKNEN10_SHIFT       (10U)
#define VFCCU_2_FHIMRKC0_150_RKNEN10_WIDTH       (1U)
#define VFCCU_2_FHIMRKC0_150_RKNEN10(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHIMRKC0_150_RKNEN10_SHIFT)) & VFCCU_2_FHIMRKC0_150_RKNEN10_MASK)

#define VFCCU_2_FHIMRKC0_150_RKNEN11_MASK        (0x800U)
#define VFCCU_2_FHIMRKC0_150_RKNEN11_SHIFT       (11U)
#define VFCCU_2_FHIMRKC0_150_RKNEN11_WIDTH       (1U)
#define VFCCU_2_FHIMRKC0_150_RKNEN11(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHIMRKC0_150_RKNEN11_SHIFT)) & VFCCU_2_FHIMRKC0_150_RKNEN11_MASK)

#define VFCCU_2_FHIMRKC0_150_RKNEN12_MASK        (0x1000U)
#define VFCCU_2_FHIMRKC0_150_RKNEN12_SHIFT       (12U)
#define VFCCU_2_FHIMRKC0_150_RKNEN12_WIDTH       (1U)
#define VFCCU_2_FHIMRKC0_150_RKNEN12(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHIMRKC0_150_RKNEN12_SHIFT)) & VFCCU_2_FHIMRKC0_150_RKNEN12_MASK)

#define VFCCU_2_FHIMRKC0_150_RKNEN13_MASK        (0x2000U)
#define VFCCU_2_FHIMRKC0_150_RKNEN13_SHIFT       (13U)
#define VFCCU_2_FHIMRKC0_150_RKNEN13_WIDTH       (1U)
#define VFCCU_2_FHIMRKC0_150_RKNEN13(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHIMRKC0_150_RKNEN13_SHIFT)) & VFCCU_2_FHIMRKC0_150_RKNEN13_MASK)

#define VFCCU_2_FHIMRKC0_150_RKNEN14_MASK        (0x4000U)
#define VFCCU_2_FHIMRKC0_150_RKNEN14_SHIFT       (14U)
#define VFCCU_2_FHIMRKC0_150_RKNEN14_WIDTH       (1U)
#define VFCCU_2_FHIMRKC0_150_RKNEN14(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHIMRKC0_150_RKNEN14_SHIFT)) & VFCCU_2_FHIMRKC0_150_RKNEN14_MASK)

#define VFCCU_2_FHIMRKC0_150_RKNEN15_MASK        (0x8000U)
#define VFCCU_2_FHIMRKC0_150_RKNEN15_SHIFT       (15U)
#define VFCCU_2_FHIMRKC0_150_RKNEN15_WIDTH       (1U)
#define VFCCU_2_FHIMRKC0_150_RKNEN15(x)          (((uint32_t)(((uint32_t)(x)) << VFCCU_2_FHIMRKC0_150_RKNEN15_SHIFT)) & VFCCU_2_FHIMRKC0_150_RKNEN15_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group VFCCU_2_Register_Masks */

/*!
 * @}
 */ /* end of group VFCCU_2_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_VFCCU_2_H_) */
